const culture = [
    [
        "./data/images/culture/1.png",
        "Костел святого Варфоломія в Дрогобичі. 1392 - XV ст."
    ],
    [
        "./data/images/culture/2.png",
        "Верхній замок у Луцьку. Друга половина XIV ст. - XV ст."
    ],
    [
        "./data/images/culture/3.png",
        "Кам'янець-Подільська фортеця. XIV -XVI ст."
    ],
    [
        "./data/images/culture/4.png",
        "Хотинська фортеця. XIII-XVI ст."
    ],
    [
        "./data/images/culture/5.png",
        "Покровська церква-фортеця в с. Сутківцях. 1476."
    ],
    [
        "./data/images/culture/6.png",
        "Замок Паланок (Мукачівський замок). XIV-XVII ст."
    ],
    [
        "./data/images/culture/7.png",
        "Генуезька фортеця у Судаку. 1371-1469."
    ],
    [
        "./data/images/culture/8.png",
        "Вірменський собор у Львові. 1363."
    ],
    [
        "./data/images/culture/9.png",
        "Ханський палацу Бахчисараї. 1532-1764."
    ],
    [
        "./data/images/culture/10.png",
        "Ікона святого Юрія Змієборця із с. Станилі поблизу м. Дрогобич."
    ],
    [
        "./data/images/culture/11.png",
        "Ікона Богородиці з пророками з церкви у Підгородцях."
    ],
    [
        "./data/images/culture/12.png",
        "Церква Зішестя Святого Духа в Потеличі. 1502."
    ],
    [
        "./data/images/culture/13.png",
        "Ансамбль Успенської церкви у Львові: церква Успіння. 1591-1629; вежа Святителів. 1578."
    ],
    [
        "./data/images/culture/14.png",
        "Ансамбль площі Ринок у Львові: Чорна Кам'яниця. Кінець XVI ст.; будинок Корнякта. 1580."
    ],
    [
        "./data/images/culture/15.png",
        "Острозький замок. Кругла (Нова) вежа. Кінець XVI ст."
    ],
    [
        "./data/images/culture/16.png",
        "Ікона «Успіння Богородиці». 1547. О. Горошковим."
    ],
    [
        "./data/images/culture/17.png",
        "Мініатюри Пересопницького Євангелія. 1556-1561."
    ],
    [
        "./data/images/culture/18.png",
        "Євангеліст Лука. Гравюра з львівського «Апостола» 1574."
    ],
    [
        "./data/images/culture/19.png",
        "Ансамбль Кафедрального костелу у Львові: каплиця Боїмів. 1609-1617."
    ],
    [
        "./data/images/culture/20.png",
        "Замок у Підгірцях (Львівська обл.). 1635-1640."
    ],
    [
        "./data/images/culture/21.png",
        "Іллінська церква в Суботові. 1653."
    ],
    [
        "./data/images/culture/22.png",
        "Портрет Петра Конашевича-Сагайдачного з книги «Вірші на жалісний погреб шляхетного рицаря Петра Конашевича-Сагайдачного». 1622."
    ],
    [
        "./data/images/culture/23.png",
        "Портрет князя Криштофа Збаразького. Після 1622."
    ],
    [
        "./data/images/culture/24.png",
        "Троїцький собор Троїцько-Іллінського монастиря в Чернігові. 1679-1689."
    ],
    [
        "./data/images/culture/25.png",
        "Покровський собор у Харкові. 1689."
    ],
    [
        "./data/images/culture/26.png",
        "Портрет Богдана Хмельницького В. Гондіуса. Середина XVII ст."
    ],
    [
        "./data/images/culture/27.png",
        "Ікона «Покров Богородиці» (з портретом гетьмана Богдана Хмельницького). Перша половина XVIII ст."
    ],
    [
        "./data/images/culture/28.png",
        "Оборонна синагога в Жовкві. 1692-1698."
    ],
    [
        "./data/images/culture/29.png",
        "Георгіївська церква Видубицького монастиря в Києві. 1696-1701."
    ],
    [
        "./data/images/culture/30.png",
        "Преображенська церква у Великих Сорочинцях. 1732."
    ],
    [
        "./data/images/culture/31.png",
        "Ікона «Вознесіння Христове» з іконостасу церкви Воздвиження Чесного Хреста монастиря Скит Манявський. Й.Кондзелевич."
    ],
    [
        "./data/images/culture/32.png",
        "Гравюра «Іван Мазепа серед своїх добрих справ». 1706. І. Мигура."
    ],
    [
        "./data/images/culture/33.png",
        "Собор святого Юра у Львові. 1746-1762."
    ],
    [
        "./data/images/culture/34.png",
        "Андріївська церква у Києві. 1747-1757."
    ],
    [
        "./data/images/culture/35.png",
        "Ратуша в Бучачі. 1751."
    ],
    [
        "./data/images/culture/36.png",
        "Покровська церква в Києві. 1766."
    ],
    [
        "./data/images/culture/37.png",
        "Троїцький собор у Новомосковську. 1773-1778. Майстер Я.Погребняк."
    ],
    [
        "./data/images/culture/38.png",
        "Успенський собор Почаївської лаври. 1771-1783."
    ],
    [
        "./data/images/culture/39.png",
        "Палац Кирила Розумовського в Батурині. 1799-1803. Сучасний вигляд."
    ],
    [
        "./data/images/culture/40.png",
        "Скульптурна група святого Юрія змієборця на фасаді собору святого Юра у Львові. Скульптор Й. Пінзель"
    ],
    [
        "./data/images/culture/41.png",
        "Будівля Київського університету. 1837-1843. Образотворче мистецтво"
    ],
    [
        "./data/images/culture/42.png",
        "Картина «Дівчина з Поділля». В. Тропінін."
    ],
    [
        "./data/images/culture/43.png",
        "Картини «Автопортрет» (1840), «Катерина» 1842, офорти з серії «Живописна Україна» Т. Шевченко."
    ],
    [
        "./data/images/culture/44.png",
        "Пам'ятник князю Володимиру в Києві. 1850-1853."
    ],
    [
        "./data/images/culture/45.png",
        "Пам'ятник градоначальнику та генерал-губернатору А. де Рішельє в Одесі. Скульптор І. Мартос. 1828."
    ],
    [
        "./data/images/culture/46.png",
        "Картина «Садиба Г. Тарновського в Качанівці» В. Штернберг. 1837."
    ],
    [
        "./data/images/culture/47.png",
        "Резиденція православних митрополитів Буковини і Далмації в Чернівцях. 1864-1873."
    ],
    [
        "./data/images/culture/48.png",
        "Володимирський собор у Києві. 1862-1896."
    ],
    [
        "./data/images/culture/49.png",
        "Будівля оперного театру в Одесі. 1883-1887."
    ],
    [
        "./data/images/culture/50.png",
        "Будинок з химерами в Києві. 1901-1903."
    ],
    [
        "./data/images/culture/51.png",
        "Будинок Полтавського губернського земства. 1903-1908."
    ],
    [
        "./data/images/culture/52.png",
        "Будинок страхового товариства «Дністер» у Львові. 1905-1906."
    ],
    [
        "./data/images/culture/53.png",
        "Пам'ятник Богдану Хмельницькому в Києві. 1888. Скульптор М. Микешин"
    ],
    [
        "./data/images/culture/54.png",
        "Картина «Запорожці пишуть листа турецькому султанові». 1880-1891. І. Рєпін."
    ],
    [
        "./data/images/culture/55.png",
        "Картина «Козаки в степу». 1890. С. Васильківський."
    ],
    [
        "./data/images/culture/56.png",
        "Картина «Святочне Ворожіння». 1888. М. Пимоненко."
    ],
    [
        "./data/images/culture/57.png",
        "Картина «Дівчина в червоному капелюсі». 1902-1903. О. Мурашко."
    ],
    [
        "./data/images/culture/58.png",
        "Картина «Портрет Лесі Українки». 1900.1. Труш."
    ],
    [
        "./data/images/culture/59.png",
        "Будівля Держпрому в Харкові. 1925-1928."
    ],
    [
        "./data/images/culture/60.png",
        "Будівля Верховної Ради УРСР в Києві. 1936-1939."
    ],
    [
        "./data/images/culture/61.png",
        "«Еней та його військо». 1919. Г. Нарбут."
    ],
    [
        "./data/images/culture/62.png",
        "Літографія «Гуцул з квіткою», естамп «Карпатська мати». 1923. В. Касіян."
    ],
    [
        "./data/images/culture/63.png",
        "Картина «Життя». Триптих (Любов. Сім'я. Повернення). 1925-1927. Ф. Кричевський."
    ],
    [
        "./data/images/culture/64.png",
        "Пам'ятник Тарасові Шевченку в Ромнах. 1918. Скульптор І.Кавалерідзе."
    ],
    [
        "./data/images/culture/65.png",
        "Картина «Бій Богуна з Чарнецьким під Монастирищем в 1653 р.» 1931). М. Самокиш."
    ],
    [
        "./data/images/culture/66.png",
        "Картина «Хата в Богданівці» (1955). К. Білокур."
    ],
    [
        "./data/images/culture/67.png",
        "Картина «Хліб» (1949). Т. Яблонська."
    ],
    [
        "./data/images/culture/68.png",
        "Картина «Гороховий звір» (1971), М. Приймаченко."
    ],
    [
        "./data/images/culture/69.png",
        "Пам'ятник засновникам Києва (Кий, Щек, Хорив і сестра їх Либідь). Скульптор В. Борода"
    ]
]
