const dates = [
    [
        "Перша згадка про козаків у писемних джерелах",
        "1489"
    ],
    [
        "Битва біля м. Орша",
        "1514"
    ],
    [
        "Заснування князем Дмитром Вишневецьким на о. Мала Хортиця першої відомої Січі",
        "1556"
    ],
    [
        "Створення Пересопницького Євангелія ",
        "1556–1561"
    ],
    [
        "Перший Литовський статут",
        "1529"
    ],
    [
        "Другий Литовський статут (урівнення в правах боярства-шляхти з князівсько-магнатською аристократією; виборні суди; система повітових сеймиків)",
        "1566"
    ],
    [
        "Люблінська унія. Утворення Речі Посполитої (виборний король, спільний сейм, єдина грошова система, урівнено в правах польську та українську шляхту;  Литва зберігала за собою право та суд, адміністрацію, військо, «руську мову»)",
        "1569"
    ],
    [
        "Реєстрове козацтво Сигізмунда Августа",
        "1572"
    ],
    [
        "Видання книг І. Федорова «Апостол» та «Буквар» (перший друкований підручник для навчання грамоти) ",
        "1574"
    ],
    [
        "Відкриття Острозької слов’яно-греко-латинської академії (ректор Г. Смотрицький; викладачі: І. Княгинецький, Д. Наливайко, К. Лукаріс та ін., серед вихованців: М. Смотрицький, П. Конашевич-Сагайдачний, Й. Борецький)",
        "1576"
    ],
    [
        "Похід І. Підкови на Молдову (страчений у Львові)",
        "1577–1578"
    ],
    [
        "Козацька реформа Стефана Баторія (600 осіб реєстровців)",
        "1578"
    ],
    [
        "Видання Острозької Біблії І. Федорова",
        "1581"
    ],
    [
        "Запровадження григоріанського календаря (папа Григорій XIII)",
        "1582"
    ],
    [
        "Утворення першої братської (слов’яно-греко-латинської) школи у м. Львів\n\n(Антіохійський патріарх Йоаким затвердив Статут Львівського Успенського братства, згодом воно отримало право Ставропігії (підпорядкування Константинопольському патріарху)",
        "1586"
    ],
    [
        "Третій Литовський статут (селяни, що прожили понад 10 років у пана, ставали кріпаками)",
        "1588 "
    ],
    [
        "«Порядок щодо козаків та України» (у випадку війни з Туреччиною кількість реєстровців зростає, заборона селянам іти на Запоріжжя)",
        "1590"
    ],
    [
        "Вихід твору Л. Зизанія «Адельфотес» ",
        "1591"
    ],
    [
        "Повстання Криштофа Косинського (охоплення району Білої Церкви, Черкас, Канева; поразка повсталих від військ В.-К. Острозького під П’яткою)",
        "1591–1593"
    ],
    [
        "Берестейська церковна унія; утворення Української Греко-Католицької Церкви (УГКЦ)",
        "1596"
    ],
    [
        "Повстання С. Наливайка (поразка від військ С. Жолкевського в Солоницькій битві поблизу Лубен; страчений у Варшаві)",
        "1596"
    ],
    [
        "Вихід твору Л. Зизанія «Граматика словенська»",
        "1596"
    ],
    [
        "Заснування Київського Богоявленського братства (вступ П. Конашевича-Сагайдачного з Кошем Запорозьким)",
        "1615"
    ],
    [
        "Здобуття козаками П. Конашевича-Сагайдачного м. Кафи (сучасна Феодосія) де розташовувався невільничий ринок",
        "1616"
    ],
    [
        "Заснування Луцького Хрестоздвиженського братства",
        "1617"
    ],
    [
        "Похід козаків під проводом П. Конашевича-Сагайдачного на Москву; підписання Деулінських угод; Річ Посполита отримала Чернігово-Сіверщину та Смоленщину",
        "1618"
    ],
    [
        "Битва під Цецорою (поразка С. Жолкевського від Туреччини)",
        "1620"
    ],
    [
        "Відновлення вищої православної церковної ієрархії; висвячення Феофаном на посаду митрополита Йова Борецького (з ініціативи П. Конашевича-Сагайдачного)",
        "1620"
    ],
    [
        "Хотинська війна (участь військ гетьмана П. Конашевича-Сагайдачного проти Османської імперії разом із військами С. Жолкевського; поразка Османа у війні)",
        "1621"
    ],
    [
        "Куруківська угода (протистояння С. Конєцпольського з військами М. Жмайла поблизу м. Бар; створення 6 полків реєстровців)",
        "1625"
    ],
    [
        "Повстання нереєстровців під проводом Т. Федоровича (Трясила); бій під Переяславом, «Тарасова ніч»; підписання Переяславської угоди (кількість реєстровців – 8 тис. козаків)",
        "1630"
    ],
    [
        "Заснування П. Могилою Лаврської школи",
        "1631"
    ],
    [
        "«Пункти для заспокоєння руського народу»",
        "1632"
    ],
    [
        "Утворення Києво-Могилянської колегії",
        "1632"
    ],
    [
        "Захоплення та руйнування І. Сулимою фортеці Кодак (збудована французьким інженером Ґ. Л. де Бопланом з метою не допускати козаків у походи на турків і татар)",
        "1635"
    ],
    [
        "Повстання під проводом Павла Павлюка, Якова Острянина, Дмитра Гуні",
        "1637–1638"
    ],
    [
        "Поразка повсталих під Кумейками",
        "1637"
    ],
    [
        "«Ординації Війська Запорозького реєстрового…..», Жовнинська битва (повсталих козаків очолювали Я. Остряниця, Д. Гуня, К. Скидай)",
        "1638"
    ],
    [
        "«Золотий спокій»; зародження невдоволення українців польською владою",
        "1638–1648"
    ],
    [
        "Видання творів: «Требник» П. Могили, «Православне сповідання віри» І. Трофимовича",
        "1646"
    ],
    [
        "Битва під Жовтими Водами",
        "травень 1648"
    ],
    [
        "Битва під Корсунем (розгром 20-тисячних військ М. Потоцького)",
        "травень 1648"
    ],
    [
        "Битва під Пилявцями; оголошення «посполитого рушення» (шляхетського ополчення)",
        "вересень 1648"
    ],
    [
        "Захоплення військами М. Кривоноса Високого Замку у Львові",
        "вересень 1648"
    ],
    [
        "Урочистий в’їзд Б. Хмельницького до Києва (Хмельницького зустрічали єрусалимський патріарх Паїсій та митрополит Сильвестр Косів)",
        "грудень 1648"
    ],
    [
        "До Переяслава прибуває польське посольство, виголошення гетьманом програми розбудови української держави",
        "лютий 1649"
    ],
    [
        "Похід Литовський князя Я. Радзивілла через Білорусь на Київ (йому протистояли війська козацького полковника М. Кричевського; бій під Лоєвим; смерть полковника)",
        "1649"
    ],
    [
        "Зборівська битва, Зборівський договір (під владою гетьмана – Київське, Брацлавське, Чернігівське воєводства,; кількість реєстровців – 40 тисяч)",
        "1649"
    ],
    [
        "Похід Я. Радзивілла на Київ; пограбування міста",
        "1651"
    ],
    [
        "Берестецька битва, Білоцерківський  договір (під владою гетьмана – Київщина, кількість реєстровців – 20 тисяч; поляки повертаються на свої землі)",
        "1651"
    ],
    [
        "Батозька битва (помста за Берестечко)",
        "1652"
    ],
    [
        "Існування Чортомлицької Січі на р. Чортомлик",
        "1652–1709"
    ],
    [
        "Заснування І. Дзиковським слободи Острогозьк (вихідці з Острога)",
        "1652"
    ],
    [
        "Похід Т. Хмельницького на Молдову (допомога своєму тестю); смерть Тимоша",
        "1653"
    ],
    [
        "Битва під Жванцем, Камʼянецький договір (домовленість поляків і татар про припинення воєнних дій; Хмельницький у переговорах участі не брав)",
        "1653"
    ],
    [
        "Переяславська рада, українсько-московський договір («Березневі статті») (присяга гетьмана і козаків на вірність московському царю Олексію; Конфедерація)",
        "1654"
    ],
    [
        "Заснування Харкова. Існування 5 полків на Слобожанщині ",
        "1654"
    ],
    [
        "Вигнання московсько-українськими військами під командуванням І. Золотаренка поляків з Білорусі",
        "1655"
    ],
    [
        "Охматівська битва; похід на Галичину; перемога над польськими військами С. Потоцького під Городком",
        "січень 1655"
    ],
    [
        "Московсько-польське Віленське перемир’я (обіцянка Речі Посполитої надати корону російському царю Олексію)",
        "1656"
    ],
    [
        "Утворення союзу Трансільванії та України проти Польщі (Швеція брала участь у переговорах) ",
        "жовтень 1656"
    ],
    [
        "Похід Юрія ІІ, Дердя Ракоці та військ Антона Ждановича на Польщу, взяття Варшави; капітуляція трансильванського правителя; повернення козаків в Україну. Смерть Б. Хмельницького",
        "1657"
    ],
    [
        "Корсунська рада (обрання І. Виговського гетьманом)",
        "1657"
    ],
    [
        "Гадяцький договір (сторони договору: Польща, Литва, Велике князівство Руське)",
        "1658"
    ],
    [
        "Конотопська битва; московсько-українська війна",
        "1659"
    ],
    [
        "Гетьманство Ю. Хмельницького; Чуднівська кампанія (граф В. Шереметьєв)",
        "1659"
    ],
    [
        "Слободищенська угода",
        "1660"
    ],
    [
        "Фактичний поділ України на Правобережну (П. Тетеря); та Лівобережну (І. Брюховецький) (Чорна рада в Ніжині); зречення гетьманства Ю. Хмельницьким",
        "1663"
    ],
    [
        "Поїздка І. Брюховецького до Москви; Московські статті",
        "1665"
    ],
    [
        "Похід П. Тетері з поляками на Лівобережжя",
        "1663–1664"
    ],
    [
        "П. Дорошенко – гетьман Правобережжя; створення «сердюків»",
        "1665–1676"
    ],
    [
        "Андрусівський перемир’я між Московією та Польщею (без українців); юридичний поділ України",
        "1667"
    ],
    [
        "П. Дорошенко – гетьман обох боків Дніпра",
        "1668"
    ],
    [
        "Корсунська угода, визнання Правобережною Гетьманщиною протекторату Османської імперії",
        "1669"
    ],
    [
        "Д. Многогрішний – (наказний) гетьман Лівобережжя; підписання Глухівських статей (27 пунктів); утворення «компанійців»",
        "1669–1672"
    ],
    [
        "І. Самойлович – гетьман Лівобережжя. Утворення бунчукового товариства, укладання Конотопських статей; забудова Троїцького собору Густинського монастиря під Прилуками; церкви Іоанна Предтечі",
        "1672–1687"
    ],
    [
        "Протистояння П. Дорошенка з Мохамедом IV проти М. Ханенка (його підтримувала Польща) на Брацлавщині, перемога П. Дорошенка, похід на Галичину; підписання Бучацького договору",
        "1672"
    ],
    [
        "Перший і другий чигиринські походи Туреччини",
        "1677–1678"
    ],
    [
        "«Великий згін» (насильницьке переселення мешканців з Правобережної України на Лівобережну, організоване гетьманом І. Самойловичем)",
        "1678–1679"
    ],
    [
        "Бахчисарайський мирний договір (сторони договору: Туреччина, Московія); середня Київщина 20 років залишалася незаселеною",
        "1681"
    ],
    [
        "«Вічний мир» між Московським царством і Річчю Посполитою  (Брацлавщина та південна Київщина мали бути нейтральними).\n\nПідпорядкування Київської митрополії Московському патріархатові ",
        "1686"
    ],
    [
        "Перший Кримський похід В. Голіцина (допомога І. Самойловича, якого звинуватили в невдачі); мета – вихід Московії до Чорного моря, війна з Кримським ханством",
        "1687"
    ],
    [
        "Підписання Коломацьких статей новообраним гетьманом І. Мазепою ",
        "1687"
    ],
    [
        "Другий Кримський похід В. Голіцина",
        "1689"
    ],
    [
        "Заворушення в Переяславському, Миргородському, Полтавському полках (переросло в повстання під проводом П. Іваненка-Петрика) ",
        "1692"
    ],
    [
        "П. Іваненко-Петрик – гетьман так званої Ханської України",
        "1698–1712"
    ],
    [
        "Карловицький мир між Польщею та Туреччиною (Правобережна Україна, якою володіли турки (в основі Поділля), перейшла до Польщі)",
        "1699"
    ],
    [
        "Повстання С. Палія. Перехід І. Мазепи через Дніпро, зайняття Київщини й Волині, придушення повстання І. Палія",
        "1702–1704"
    ],
    [
        "Об’єднання Правобережної та Лівобережної України під владою І. Мазепи",
        "1704–1709"
    ],
    [
        "Україно-шведський союз, зруйнування Батурина",
        "1708"
    ],
    [
        "Призначення І. Скоропадського гетьманом (для наглядання над гетьманом призначався царський резидент А. Ізмайлов)",
        "1708–1722"
    ],
    [
        "Перехід кошового отамана Запорозької Січі К. Гордієнка з військом на бік І. Мазепи. Полтавська битва. Поразка шведів та І. Мазепи, втеча до Бендер",
        "1709"
    ],
    [
        "Зруйнування московитськими військами Чортомлицької січі, Полтавська битва",
        "1709"
    ],
    [
        "Смерть І. Мазепи",
        "1710"
    ],
    [
        "«Конституція…» Пилипа Орлика («Пакти й конституції законів і вольностей Війська Запорозького»: вступ і 16 статей). Обрання П. Орлика гетьманом",
        "1710"
    ],
    [
        "Похід П. Орлика разом з татарами на Україну (дійшли до Білої Церкви і повернули назад до Бендер). Прутський похід Петра І",
        "1711"
    ],
    [
        "Існування Олешківської Січі (на території Кримського ханства)",
        "1711–1728"
    ],
    [
        "Ліквідація козацтва на Правобережній Україні",
        "1713"
    ],
    [
        "Укази Петра І: про реорганізацію Генеральної військової канцелярії, про укладання адміністративних документів російською мовою",
        "1720"
    ],
    [
        "Перша Малоросійська колегія (складалася з 6 офіцерів, яких очолював граф Вельямінов)",
        "1722–1727"
    ],
    [
        "Надання першому ієрархові Київської митрополії титулу архієпископа Київського та Малої Росії (призначати його мав церковний Синод на чолі з царем у Петербурзі)",
        "1722"
    ],
    [
        "Д. Апостол – гетьман; «Рішительні пункти»; завершено укладання зводу «Права, за якими судиться малоросійський народ»",
        "1727–1734"
    ],
    [
        "Заснування Нової (Підпільненської) Січі (кошовий отаман І. Білицький, край поділено на 8 паланок (округів)",
        "1734"
    ],
    [
        "Гайдамаччина. Повстання Верлана проти Польщі ",
        "1734"
    ],
    [
        "Скорочення урядом реєстровців; поділ козаків на заможних (виборних козаків), та збіднілих (підпомічників)",
        "1735"
    ],
    [
        "Виступи загонів О. Довбуша, В. Баюрака, І. Бойчука; виступ «опришків»",
        "1738–1759"
    ],
    [
        "К. Розумовський – гетьман",
        "1751"
    ],
    [
        "Створення Нової Сербії в північно-східній частині Запоріжжя (з 1775 – м. Єлисаветград, сучасний Кропивницький); утворення Словʼяносербії (сучасні Луганська, Кіровоградська, частина Донецької областей)",
        "1752"
    ],
    [
        "Проведення судової реформи на Гетьманщині",
        "1760"
    ],
    [
        "Перетворення Мотрининського монастиря на осередок православного руху",
        "1761"
    ],
    [
        "Остаточна ліквідація посади гетьмана",
        "1764"
    ],
    [
        "Утворення Другої Малоросійської колегії (очолював П. Румянцев, який здійснив Генеральний опис Малоросії)",
        "1764–1782"
    ],
    [
        "Створення Законодавчої комісії, член якої Г. Полєтика намагався повернути українській шляхті старі привілеї",
        "1767"
    ],
    [
        "Російсько-турецька війна (закінчилася Кючук-Кайнарджинським договором, кордони Росії відсунулись на південь і таким чином Січ опинилася в межах Російської імперії)",
        "1768–1774"
    ],
    [
        "Коліївщина (керівники: М. Залізняк, І. Гонта; повстання охопило Київщину та Брацлавщину, зокрема гайдамаки взяли Умань; повстання придушене російською владою; страта гайдамаків відбувалась у м. Кодня)",
        "1768"
    ],
    [
        "І поділ Речі Посполитої (Галичина відходить до Австрійської імперії)",
        "1772"
    ],
    [
        "Остаточна ліквідація Запорозької Січі (наказ Катерини ІІ генералові П. Текелі; російська армія напала і зруйнувала Січ, останній кошовий отаман П. Калнишевський ув’язнений у Соловецький монастир. Задунайська Січ, Банатська Січ",
        "1775"
    ],
    [
        "Ліквідація особистої залежності селян в Австрійській імперії",
        "1780–1782"
    ],
    [
        "Поділ Гетьманщини на три намісництва: Київське, Чернігівське, Новгород-Сіверське (згодом вони утворили Малоросійське генерал-губернаторство)",
        "1781"
    ],
    [
        "Закріпачення селян Лівобережної та Слобідської України.\n\nПідкорення Російською імперією Кримського ханства\n\n(ліквідований полковий устрій, запроваджено повіти)",
        "1783"
    ],
    [
        "Повстання С. Гаркуші (повстання придушене російською владою)",
        "1784"
    ],
    [
        "«Грамота про вільність дворянства» (українську шляхту урівняно в правах з російським дворянством)",
        "1785"
    ],
    [
        "Російсько-турецька війна (закінчилася Ясським мирним договором, Крим було закріплено в складі Росії)",
        "1787–1791"
    ],
    [
        "Утворення групи автономістів на чолі з В. Капністом (відстоювали автономію Гетьманщини, виступали за відновлення козацького війська)",
        "1787"
    ],
    [
        "Утворення Чорноморського козацького війська",
        "1788"
    ],
    [
        "Місія В. Капніста до Берліна, переговори з канцлером Пруссії",
        "1791"
    ],
    [
        "Переселення Чорноморського козацького війська на Кубань, з 1860р. має назву Кубанське козаче військо",
        "1792"
    ],
    [
        "ІІ поділ Речі Посполитої (Правобережжя переходить під контроль Російської імперії)",
        "1793"
    ],
    [
        "ІІІ поділ Речі Посполитої (Річ посполита припинила своє існування, до Росії відходять землі західної Волині)",
        "1795"
    ],
    [
        "Видання «Енеїди» І. Котляревського ",
        "1798"
    ],
    [
        "Відкриття Харківського університету (з ініціативи В. Каразіна)",
        "1805"
    ],
    [
        "Російсько-турецька війна (закінчилася Бухарестським мирним договором, до Росії відійшла Бессарабія)",
        "1806–1812"
    ],
    [
        "Рух опришків на Прикарпатті (очолював М. Штолюк)",
        "1810–1825"
    ],
    [
        "Напад Наполеона Бонапарта на Росію",
        "1812"
    ],
    [
        "Повстання (з перервами) під проводом У. Кармелюка на Поділлі",
        "1813–1830"
    ],
    [
        "Утворення військових поселень (з 25 округів військових поселень три зосереджені на Харківщині, Катеринославщині, Херсонщині)",
        "1816–1857"
    ],
    [
        "Створення освітнього товариства греко-католицьких священників (у Перемишлі під патронатом єпископа М. Левицького помічник І. Могильницький зібрав гурт священників і заснував перше просвітницьке товариство греко-католицьких священників)",
        "1816"
    ],
    [
        "Оголошення Одеси відкритим містом (порто-франко)",
        "1817"
    ],
    [
        "Повстання бузьких козаків на Херсонщині ",
        "1817"
    ],
    [
        "Закриття Києво-Могилянської академії. Відкриття в Одесі Рішельєвського ліцею. Заснування Львівського інституту Оссолінських",
        "1817"
    ],
    [
        "Утворення в Полтаві масонської ложі «Любов до істини» (членом ложі був І. Котляревський)",
        "1818–1819"
    ],
    [
        "Переїзд М. Щепкіна з Харкова до Полтавського театру (Полтавський театр припинив свою роботу 1821 р.)",
        "1818"
    ],
    [
        "Повстання військових поселенців у Чугуєві",
        "1819"
    ],
    [
        "Відкриття гімназії Вищих наук у Ніжині",
        "1820"
    ],
    [
        "Малоросійське товариство (очолював В. Лукашевич); програмний документ – «Катехизис автономіста»",
        "1821"
    ],
    [
        "Утворення Південного (П. Пестель, «Руська правда») й Північного товариства (М. Муравйов, «Конституція») декабристів (офіцерські організації (декабристи) ставили за мету скинути самодержавство без будь-чиєї допомоги)",
        "1821"
    ],
    [
        "Повстання Чернігівського полку",
        "грудень 1825 – січень 1826"
    ],
    [
        "Російсько-турецька війна (перехід Задунайської Січі в межі Російської імперії, ініціатор переходу – Й. Гладкий)",
        "1828–1829"
    ],
    [
        "Ліквідація Задунайської Січі",
        "1828"
    ],
    [
        "Польське визвольне повстання",
        "1830–1831"
    ],
    [
        "Промисловий переворот у Російській імперії",
        "1830-ті – 1880-ті"
    ],
    [
        "Ліквідація Магдебурзького права на Лівобережжі",
        "1831"
    ],
    [
        "«Холерні бунти» на Закарпатті",
        "1831"
    ],
    [
        "Створення Азовського козачого війська (проіснувало до 1866 р.)",
        "1832"
    ],
    [
        "Діяльність  «Руської трійці» (М. Шашкевич, Я. Головацький, І. Вагилевич)",
        "1833–1837"
    ],
    [
        "Відкриття університету в Києві (Університет святого Володимира, ректор М. Максимович)",
        "1834"
    ],
    [
        "Видання «Русалки Дністрової» (у Будапешті стараннями Я. Головацького)",
        "1837"
    ],
    [
        "Ліквідація царською владою Греко-Католицької Церкви на Правобережжі",
        "1839"
    ],
    [
        "Перше видання «Кобзаря» Тараса Шевченка (Петербург)",
        "1840"
    ],
    [
        "Повстання під проводом Л. Кобилиці на Буковині",
        "1844"
    ],
    [
        "Ліквідація судочинства за Литовським статутом",
        "1841"
    ],
    [
        "Видання «Історії Русів» (Москва)",
        "1846"
    ],
    [
        "Діяльність Кирило-Мефодіївського братства (засновники: М. Костомаров, М. Гулак, В. Білозерський; програмні документи: «Книга буття українського народу», «Статут братства св. Кирила та Мефодія»)",
        "1846–1847"
    ],
    [
        "Скасування панщини в Галичині",
        "1848"
    ],
    [
        "Створення Головної Руської Ради. Видання першої українськомовної газети «Зоря Галицька»",
        "1848"
    ],
    [
        "«Весна народів» (революційні події проти самодержавства в європейських країнах). Проголошення конституції в Австрійській імперії, відкриття парламенту. Діяльність видавництва Галицько-руська матиця; відкриття кафедри української мови та літератури у Львівському університеті (очолював Я. Головацький)",
        "1848"
    ],
    [
        "Собор руських вчених у Львові",
        "жовтень 1848"
    ],
    [
        "Повстання під проводом Л. Кобилиці на Буковині",
        "1848–1850"
    ],
    [
        "Діяльність Головної руської ради",
        "1848–1851"
    ],
    [
        "Слов’янський з’їзд у Празі (організації-учасниці: Центральна рада народова, Головна руська рада, «Руський собор»)",
        "1849"
    ],
    [
        "Кримська війна",
        "1853–1856"
    ],
    [
        "Спроба підняти національно-визвольне повстання під проводом М. Чайковського (Садик-паша)",
        "1854"
    ],
    [
        "Селянський рух «Київська козаччина» (селяни складали списки вільних козаків і відмовлялися від панщини)",
        "1855"
    ],
    [
        "Селянський рух «У Таврію за волею»",
        "1856"
    ],
    [
        "Виникнення першої громади; відкриття в Києві першої в Російській імперії недільної школи",
        "1859"
    ],
    [
        "Діяльність «хлопоманів»",
        "початок 1860-х"
    ],
    [
        "Формування в Україні Донецького вугільно-металургійного, Криворізького залізорудного, Нікопольського марганцевого промислових центрів; прискорений розвиток зернового і цукробурякового виробництва",
        "1860-ті – 1890-ті"
    ],
    [
        "Фінансова реформа; утворення Державного банку; розвиток мережі приватних банків",
        "1860"
    ],
    [
        "Початок громадівського руху в Україні; створення в Києві Української громади",
        "1860"
    ],
    [
        "Видання в Петербурзі першого українського журналу «Основа»",
        "1861–1862"
    ],
    [
        "Царський маніфест про скасування кріпосного права в Російській імперії (категорія тимчасовозобов’язаних була скасована через 20 років; відрізки / прирізки на Правобережжі)",
        "19 лютого\n\n1861"
    ],
    [
        "Валуєвський циркуляр (заборона друкування українською мовою освітніх і релігійних видань)",
        "1863"
    ],
    [
        "Польське національно-визвольне повстання (повстання проти Росії, охопило й Правобережну Україну)",
        "1863–1864"
    ],
    [
        "Будівництво залізниці Балта-Одеса",
        "1863–1865"
    ],
    [
        "Судова реформа. Земська реформа. Освітня реформа",
        "1864"
    ],
    [
        "Цензурна реформа",
        "1865"
    ],
    [
        "Відкриття Новоросійського університету (Одеса)",
        "1865"
    ],
    [
        "Отримання волі державними селянами Російської імперії",
        "1866"
    ],
    [
        "Створення у м. Львові товариства «Просвіта»",
        "1868"
    ],
    [
        "Відновлення громадівського руху",
        "початок 1870-х"
    ],
    [
        "Діяльність в Україні «чайковців»; «Київська комуна» (народники)",
        "1870-ті"
    ],
    [
        "Міська реформа (у містах утворено думи, які очолюють голови)",
        "1870"
    ],
    [
        "Створення у м. Львові літературного товариства ім. Т. Шевченка (від 1892 р. – Наукове товариство ім. Тараса Шевченка)",
        "1873"
    ],
    [
        "Діяльність Південно-Західного відділу Російського географічного товариства",
        "1873–1876"
    ],
    [
        "Військова реформа (тривалість служби – 6–7 років)",
        "1874"
    ],
    [
        "Здійснення народниками масового «ходіння в народ»",
        "1874"
    ],
    [
        "Початок діяльності гуртка «Південних бунтарів»",
        "1875"
    ],
    [
        "Відкриття Чернівецького університету",
        "1875"
    ],
    [
        "Емський указ (заборона української мови імператором Олександром ІІ)",
        "1876"
    ],
    [
        "Створення «Таємної дружини»; «Чигиринська змова»",
        "1877"
    ],
    [
        "Початок закордонної діяльності М. Драгоманова; журнал «Громада»",
        "1878"
    ],
    [
        "Створення Русько-української радикальної партії (РУРП)",
        "1890"
    ],
    [
        "Виникнення таємної студентської організації «Братство тарасівців»",
        "1892–1893"
    ],
    [
        "Видання книги Ю. Бачинського «Україна irredenta» (Україна уярмлена)",
        "1895"
    ],
    [
        "Створення Загальної української організації",
        "1897"
    ],
    [
        "Створення Російської соціал-демократичної робітничої партії (РСДРП)",
        "1898"
    ],
    [
        "Створення Української національно-демократичної партії та Української соціал-демократичної партії",
        "1899"
    ],
    [
        "Розгортання процесу монополізації Наддніпрянської України",
        "кінець ХІХ – початок ХХ ст."
    ],
    [
        "Будівництво Луганського паровозобудівного заводу",
        "1900"
    ],
    [
        "Економічна криза в українських губерніях Російської імперії",
        "1900–1903"
    ],
    [
        "Створення Революційної української партії (РУП)",
        "1900"
    ],
    [
        "Видання брошури М. Міхновського «Самостійна Україна»",
        "1900"
    ],
    [
        "Створення першого гуртка спортивно-фізкультурної організації «Січ»",
        "1900"
    ],
    [
        "Обрання Андрея Шептицького митрополитом Української Греко-Католицької Церкви",
        "1900"
    ],
    [
        "Заснування Української народної партії",
        "1901–1902"
    ],
    [
        "Масовий селянський страйк у Західній Україні",
        "1902"
    ],
    [
        "Демократична революція в Російській імперії",
        "1905–1907"
    ],
    [
        "«Кривава неділя»",
        "9 січня 1905"
    ],
    [
        "РУП перейменовано в Українську соціал-демократичну робітничу партію (УСДРП). Обʼєднання УДП і УРП в Українську демократично-радикальну партію (УДРП)",
        "1905"
    ],
    [
        "Маніфест Миколи ІІ про громадянські свободи та створення І Державної Думи",
        "17 жовтня 1905"
    ],
    [
        "Створення перших в Наддніпрянській Україні товариств «Просвіта» (Катеринослав, Одеса)",
        "1905"
    ],
    [
        "Вихід першої української газети «Хлібороб». Закон, який дозволяв видавати літературу національними мовами, створювати культурно-освітні національні товариства і відкривати національні театри",
        "1905"
    ],
    [
        "Початок видання в Києві щоденної української газети «Громадська думка»",
        "1906"
    ],
    [
        "Офіційне скасування обмежень української мови, уведених Емським указом",
        "1906"
    ],
    [
        "Діяльність української парламентської громади у І та ІІ Державних думах",
        "1906–1907"
    ],
    [
        "Указ, що започаткував Столипінську аграрну реформу (завершена законами від червня 1910 р. і травня 1911 р.)",
        "1906"
    ],
    [
        "Третьочервневий переворот, закінчення революції.\nПочаток діяльності в Києві Українського наукового товариства (УНТ)",
        "червень 1907"
    ],
    [
        "Упровадження в Австро-Угорській імперії виборчого права для чоловіків",
        "1907"
    ],
    [
        "Створення Товариства українських поступовців (ТУП)",
        "1908"
    ],
    [
        "Промислове піднесення Наддніпрянської України",
        "1908–1913"
    ],
    [
        "Циркуляр Столипіна із забороною реєструвати будь-які чужорідні товариства й видавництва",
        "1910"
    ],
    [
        "Справа «Бейліса»",
        "1911"
    ],
    [
        "Створення таємного гуртка «Пласт». Розправа в Дрогобичі над виборцями до Австро-Угорського парламенту",
        "1911"
    ],
    [
        "Створення військово-патріотичного товариства «Січові стрільці»",
        "1912"
    ],
    [
        "Перший у післяреволюційний період масовий виступ українців (під час поховання М. Лисенка)",
        "1912"
    ],
    [
        "Виступ Д. Донцова з програмою політичного відокремлення від Росії",
        "1913"
    ],
    [
        "Протести проти заборони святкування в Києві століття від дня народження Т. Шевченка",
        "1914"
    ],
    [
        "Початок Першої світової війни",
        "серпень 1914"
    ],
    [
        "Створення Головної Української Ради. Формування легіону Українських січових стрільців (УСС). Створення Союзу визволення України (СВУ)",
        "серпень 1914 "
    ],
    [
        "Галицька битва",
        "серпень-вересень 1914"
    ],
    [
        "Російський окупаційний режим у Галичині; утворення Галицько-Буковинського генерал-губернаторства",
        "вересень 1914"
    ],
    [
        "Утворення Загальної української ради (Відень)",
        "1915"
    ],
    [
        "Бій за гору Маківка (42 легіонери було вбито і 76 поранено)",
        "1915 "
    ],
    [
        "Контрнаступ австро-угорських військ; звільнення Галичини. Горлицька операція",
        "1915 "
    ],
    [
        "«Брусиловський прорив»",
        "1916 "
    ],
    [
        "Бій УСС за гору Лисоня",
        "вересень 1916"
    ],
    [
        "Лютнева демократична революція; повалення самодержавства; Тимчасовий уряд; ради робітничих і солдатських депутатів",
        "1917"
    ],
    [
        "Утворення Української Центральної Ради (УЦР)",
        "березень 1917"
    ],
    [
        "Всеукраїнський Національний  Конгрес.\n\nЛегітимізація діяльності УЦР. Створення «Українського клубу ім. П. Полуботка» стараннями М.Міхновського. Утворення полку ім. Б. Хмельницького",
        "квітень 1917"
    ],
    [
        "Перший Військовий з’їзд. Утворення Військового Генерального комітету (головою обрано С. Петлюру), делегація (на чолі з В.Винниченком) до Тимчасового уряду",
        "травень 1917"
    ],
    [
        "Перший Універсал УЦР (проголошення автономії). Утворення Генерального секретаріату на чолі з В. Винниченком",
        "червень 1917"
    ],
    [
        "Другий Універсал УЦР.\n\nПриїзд до Києва І. Церетеллі, О. Керенського, М. Терещенка. Компроміс із Тимчасовим урядом. Урядова криза в Росії, виступ більшовиків; збройний виступ самостійників",
        "липень 1917"
    ],
    [
        "«Тимчасова інструкція Генеральному Секретаріатові Тимчасового уряду на Україні». Державна нарада в Москві – корніловський заколот",
        "серпень 1917"
    ],
    [
        "З’їзд народів Росії в Києві",
        "вересень 1917"
    ],
    [
        "Більшовицький переворот у Петрограді. Нейтральна позиція УЦР",
        "25 жовтня (7 листопада) 1917"
    ],
    [
        "Третій Універсал УЦР (проголошення Української Народної Республіки (УНР), соціально-економічні питання)",
        "листопад 1917"
    ],
    [
        "Маніфест Ради Народних Комісарів (РНК) до українського народу з ультимативними вимогами до УЦР",
        "грудень 1917"
    ],
    [
        "Установлення більшовицької влади в Харкові. З’їзд рад у Харкові. Створення Народного секретаріату",
        "грудень 1917"
    ],
    [
        "Проголошення Кримської народної республіки",
        "грудень 1917"
    ],
    [
        "Четвертий Універсал УЦР (проголошення незалежності Української Народної Республіки)",
        "9(22) січня 1918"
    ],
    [
        "Початок наступу червоних військ на Київ. Бій під Крутами. Вступ військ М. Муравйова до Києва",
        "січень 1918"
    ],
    [
        "Берестейській мирний договір між УНР та державами Четверного союзу",
        "січень (лютий) 1918"
    ],
    [
        "Підписання Брест-Литовського мирного договору між РСФРР і Німеччиною. Повернення УЦР до Києва.",
        "березень 1918"
    ],
    [
        "Державний переворот і прихід до влади Павла Скоропадського.\n\nУкраїнська держава (виконавчий орган влади – Рада міністрів)",
        "29 квітня 1918"
    ],
    [
        "Утворення Українського національного союзу (УНС) (голова – В. Винниченко)",
        "серпень 1918"
    ],
    [
        "Листопадовий зрив у Львові",
        "1 листопада 1918"
    ],
    [
        "Проголошення Західноукраїнської народної Республіки (ЗУНР).\n\nСтворення Державного секретаріату ЗУНР. Утворення Української Галицької армії (УГА)",
        "13 листопада 1918"
    ],
    [
        "Українсько-польська війна",
        "1918–1919"
    ],
    [
        "Утворення Директорії (голова – В. Винниченко)",
        "14 листопада 1918"
    ],
    [
        "Заснування Української академії наук (УАН) (президент УАН – В. Вернадський)",
        "листопад 1918"
    ],
    [
        "Зрічення влади П. Скоропадським; перехід влади до рук Директорії. Домовленості з радянської Росією, Антантою, А. Денікіним, Н. Махном",
        "грудень 1918"
    ],
    [
        "Проголошення Акта злуки УНР і ЗУНР",
        "22 січня 1919"
    ],
    [
        "Вступ (другий) більшовиків до Києва",
        "лютий 1919"
    ],
    [
        "Холодноярська республіка",
        "1919–1922"
    ],
    [
        "Затвердження офіційної назви радянської України – Українська Соціалістична Радянська Республіка. Перейменування Тимчасового робітничо-селянського уряду України в Раднарком (голова – Х. Раковський)",
        "січень 1919"
    ],
    [
        "Паризька мирна конференція",
        "1919"
    ],
    [
        "Створення Кримської Соціалістичної Радянської Республіки.\n\nДекрет ВУЦВК про продовольчу диктатуру (політика «воєнного комунізму»)",
        "квітень 1919"
    ],
    [
        "Чортківська офензива. Контрнаступ Української Галицької армії під командуванням О. Грекова",
        "червень 1919"
    ],
    [
        "Перехід військами ЗУНР р. Збруч і об’єднання з військами УНР; військові дії в Києві",
        "липень 1919"
    ],
    [
        "«Київська катастрофа». Установлення Денікінського режиму. «Білий терор». Поділ території на три області: Українську, Харківську, Новоросійську",
        "серпень 1919"
    ],
    [
        "Утворення Революційної повстанської армії України (махновців). ",
        "серпень 1919"
    ],
    [
        "Перехід радянських військ у наступ (третій прихід більшовиків в Україну). Поразка військ Директорії та УГА",
        "жовтень 1919"
    ],
    [
        "Перший Зимовий похід армії УНР (під керівництвом М. Омеляновича-Павленка)",
        "грудень 1919 – травень 1920"
    ],
    [
        "Відступ денікінців з Києва; прихід радянських військ.\n\nУтворення Всеукрревкому (на чолі – Г. Петровський)",
        "грудень 1919 – (квітень 1920)"
    ],
    [
        "Варшавська угода між Польщею та УНР (підписали Ю. Пілсудський, С. Петлюра)",
        "квітень 1920"
    ],
    [
        "Вступ польської армії і військ УНР у Київ",
        "травень 1920"
    ],
    [
        "Контрнаступ радянських військ. Наступ Західного фронту на Варшаву, Південно-західного – на Львів",
        "червень 1920"
    ],
    [
        "Проголошення в Східній Галичині Галицької соціалістичної радянської республіки на чолі з Галревкомом (голова – В. Затонський). Проголошення в Сколівському повіті Бойківської радянської республіки.\n\nПереговори делегації УНР з П. Врангелем",
        "серпень 1920"
    ],
    [
        "Утворення Української військової організації",
        "1920"
    ],
    [
        "Підписання Бессарабського протоколу, визнання країнами Антанти входження Бессарабії до складу Румунії",
        "1920"
    ],
    [
        "Перемир’я Росії та Польщі (розрив з УНР). Самостійні військові дії українських військ; відступ з території України під тиском Червоної армії. Війна більшовиків (командувач М. Фрунзе) та махновців проти П. Врангеля. Штурм Перекопу; встановлення радянської влади в Криму. Розрив радянським командуванням угоди з махновцями",
        "жовтень-листопад 1920"
    ],
    [
        "Ризький мирний договір (сторони договору: Польща, РСФРР, УСРР, БСРР)",
        "березень 1921"
    ],
    [
        "Х з’їзд РКП(б) (проголошення нової економічної політики (неп))",
        "березень 1921"
    ],
    [
        "Залишення махновцями України",
        "вересень 1921"
    ],
    [
        "Другий Зимовий похід армії УНР (під керівництвом Ю. Тютюнника)",
        "листопад 1921"
    ],
    [
        "Заснування Таємного університету у Львові",
        "1921"
    ],
    [
        "Утворення Української автокефальної православної церкви (УАПЦ)",
        "1921"
    ],
    [
        "Масовий голод в Україні",
        "1921–1923"
    ],
    [
        "Початок роботи театру «Березіль» під керівництвом Л. Курбаса",
        "1922"
    ],
    [
        "Створення Союзу Радянських Соціалістичних Республік (СРСР) (УСРР, РСФРР, БСРР, Закавказька федерація (Азербайджан, Вірменія, Грузія)",
        "грудень 1922 "
    ],
    [
        "Проголошення коренізації (українізації)",
        "1923"
    ],
    [
        "Визнання країнами Антанти входження Східної Галичини до складу Польщі, саморозпуск уряду ЗУНР",
        "1923"
    ],
    [
        "Уведення двомовних (утраквістичних) шкіл у Східній Галичині",
        "1924"
    ],
    [
        "Татарбунарське повстання",
        "1924"
    ],
    [
        "Ухвалення Конституції УСРР",
        "1925"
    ],
    [
        "Проголошення курсу на індустріалізацію",
        "1925"
    ],
    [
        "Утворення Українського національно-демократичного об’єднання (УНДО)",
        "1925"
    ],
    [
        "Державний переворот у Польщі; установлення режиму «санації»",
        "1926"
    ],
    [
        "Утворення Вільної академії пролетарської літератури (ВАПЛІТЕ) (М. Хвильовий, літературна дискусія)",
        "1926–1928"
    ],
    [
        "Формування Української національної партії на Буковині",
        "1927"
    ],
    [
        "Виступ М.Волобуєва в журналі «Більшовик України» зі статтею «До проблеми української економіки»",
        "1928"
    ],
    [
        "Судовий процес у «Шахтинській справі»",
        "1928"
    ],
    [
        "Перша п’ятирічка, перехід СРСР на планову економіку",
        "1928/29–1932"
    ],
    [
        "Ліквідація Української автокефальної православної церкви",
        "1929 – початок 1930"
    ],
    [
        "Початок насильницької колективізації. \n\nФорсована індустріалізація. Будівництво Київської кіностудії",
        "1929"
    ],
    [
        "Утворення Організації українських націоналістів (ОУН)",
        "1929"
    ],
    [
        "Судовий процес Спілки визволення України (СВУ)",
        "1930"
    ],
    [
        "Постанова про загальне обов’язкове навчання",
        "1930"
    ],
    [
        "Проведення польською владою акції «пацифікації» (Східна Галичина)",
        "1930"
    ],
    [
        "Закон про охорону соціалістичної власності («закон про п’ять колосків»). Запровадження внутрішнього паспорта. Уведення в дію Дніпрогесу ",
        "1932"
    ],
    [
        "Голодомор в Україні.\n\nСамогубство М. Хвильового, арешти письменників",
        "1932–1933"
    ],
    [
        "Перенесення столиці УСРР з Харкова до Києва \n\nСтворення Спілки письменників України; ліквідація літературних об’єднань. Арешт і розправа над українськими кобзарями в Харкові",
        "1934"
    ],
    [
        "Убивство членами ОУН Б. Перацького",
        "1934"
    ],
    [
        "Почин О. Стаханова з м. Кадіївки; початок соціалістичних змагань",
        "1935"
    ],
    [
        "Варшавський та Львівський судові процеси над членами ОУН",
        "1936"
    ],
    [
        "Ухвалення Конституції УРСР (нова (Сталінська) Конституція УРСР)",
        "1937"
    ],
    [
        "«Великий терор» («Розстріляне відродження»)",
        "1937–1938"
    ],
    [
        "Постанова про вивчення російської мови в школах України з неросійською мовою викладання",
        "1938"
    ],
    [
        "Убивство в Роттердамі керівника ОУН Є. Коновальця",
        "1938"
    ],
    [
        "Надання автономії Підкарпатській Русі у складі Чехо-Словаччини",
        "1938"
    ],
    [
        "Проголошення незалежності Карпатської України",
        "15 березня 1939"
    ],
    [
        "Радянсько-німецький договір про ненапад і таємний протокол до нього («пакт Молотова–Ріббентропа») ",
        "23 серпня 1939"
    ],
    [
        "Початок Другої світової війни; вторгнення нацистських військ на територію Польщі",
        "1 вересня 1939"
    ],
    [
        "Вторгнення Червоної армії на територію Західної України ",
        "17 вересня 1939"
    ],
    [
        "Договір про розмежування зони німецької та радянської окупації по лінії Керзона (Закерзоння: Холмщина, Надсяння, Лемківщина, Підляшшя)",
        "28 вересня 1939"
    ],
    [
        "Проведення урядом СРСР Народних Зборів у Львові; проголошення радянської влади в Західній Україні",
        "27 жовтня 1939"
    ],
    [
        "Рішення Верховної Ради СРСР «задовольнити прохання» населення Західної України",
        "1 листопада 1939"
    ],
    [
        "Розкол організації ОУН після вбивства в Роттердамі Є. Коновальця на ОУН(б) (за С. Бандеру) та ОУН(м) (за А. Мельника)",
        "1939"
    ],
    [
        "Вторгнення Червоної Армії на територію Бессарабії та Північної Буковини",
        "червень 1940"
    ],
    [
        "Напад Німеччини на СРСР",
        "22 червня 1941"
    ],
    [
        "Танкова битва на початку війни на лінії Луцьк–Рівне–Броди",
        "23–29 червня 1941"
    ],
    [
        "Проголошення Акта відновлення Української Держави",
        "30 червня 1941"
    ],
    [
        "Створення Тарасом Бульбою-Боровцем загонів «Поліської січі»",
        "літо 1941"
    ],
    [
        "Захоплення Києва",
        "вересень 1941"
    ],
    [
        "Початок розстрілів в Бабиному Яру (у лютому 1942 р. розстріляно українську письменницю, члена ОУН Олену Телігу, автора альманаху «Литаври»)",
        "вересень 1941"
    ],
    [
        "Прийняття Гітлером рішення про штучне створення голоду",
        "листопад 1941"
    ],
    [
        "Створення Українського штабу партизанського руху (УШПР) на чолі з Т. Строкачем.",
        "червень 1942"
    ],
    [
        "Сталінградська битва (після неї розпочалося звільнення території СРСР від нацистів). Наказ про «загороджвальні загони»",
        "липень 1942 – лютий 1943"
    ],
    [
        "Створення Української Повстанської Армії (УПА) ",
        "14 жовтня 1942"
    ],
    [
        "Початок вигнання німецьких військ та їх союзників з України",
        "грудень 1942"
    ],
    [
        "Створення зусиллями мельниківців і В. Кубійовича (очолював єдиний легальний Український центральний комітет) дивізії СС «Галичина»",
        "весна 1943 "
    ],
    [
        "Трансформація «Поліської Січі» в Українську Народну Революційну армію",
        "1943"
    ],
    [
        "Рейд загону С. Ковпака «Від Путивля до Карпат» з метою ліквідації нафтового басейну Дрогобич–Борислав",
        "1943"
    ],
    [
        "Битва на Курській дузі (найбільша танкова битва за часів ІІ світової війни). ",
        "липень – вересень 1943"
    ],
    [
        "Звільнення з увʼязнення за клопотанням М. Бажана та О. Довженка деяких українських письменників (серед них – Остап Вишня)",
        "1943"
    ],
    [
        "Завершення О. Довженком кіноповісті «Україна в огні» (твір був підданий жорстокій критиці)",
        "літо 1943"
    ],
    [
        "Тегеранська конференція",
        "1943"
    ],
    [
        "Вигнання німецьких окупантів з м. Києва",
        "6 листопада 1943"
    ],
    [
        "Корсунь-Шевченківська наступальна операція",
        "січень-лютий 1944"
    ],
    [
        "Створення у Львівській області Української головної визвольної ради (УГВР) на чолі з К. Осьмаком",
        "початок 1944"
    ],
    [
        "Депортація кримськотатарського народу з Криму",
        "травень 1944"
    ],
    [
        "Бій дивізії СС «Галичина» проти радянських військ (дивізія кинута в бій і розбита під Бродами)",
        "червень 1944"
    ],
    [
        "Смерть митрополита Андрея Шептицького; новий керівник Української Греко-Католицької Церкви – Йосип Сліпий",
        "1944"
    ],
    [
        "Утворення в УРСР міністерства закордонних справ (Д. Мануїльський) та міністерства оборони (В. Герасименко)",
        "1944"
    ],
    [
        "Завершення вигнання німецьких військ та їх союзників з України",
        "28 жовтня 1944"
    ],
    [
        "Ялтинська конференція",
        "лютий 1945"
    ],
    [
        "Україна – співзасновниця Організації Об’єднаних Націй (ООН)",
        "квітень 1945"
    ],
    [
        "День перемоги над нацизмом у Другій світовій війні",
        "9 травня 1945"
    ],
    [
        "Потсдамська конференція",
        "липень-серпень 1945"
    ],
    [
        "Завершення  Другої світової війни",
        "2 вересня 1945"
    ],
    [
        "Входження Закарпаття до складу УРСР",
        "1945"
    ],
    [
        "Видання «Нарису історії української літератури» ",
        "1945"
    ],
    [
        "Постанова ЦК КП(б)У про перекручення та помилки у висвітленні історії української літератури",
        "1946"
    ],
    [
        "Ліквідація УГКЦ ",
        "березень 1946"
    ],
    [
        "Визнання Румунією приналежності Північної Буковини до УРСР",
        "лютий 1947"
    ],
    [
        "Масовий голод в Україні",
        "1946–1947"
    ],
    [
        "Проведення польською владою операції «Вісла»",
        "квітень – липень 1947"
    ],
    [
        "«Жданівщина»",
        "1947"
    ],
    [
        "Скасування системи продовольчих карток; грошова реформа",
        "1947"
    ],
    [
        "Операція «Захід»",
        "жовтень 1947"
    ],
    [
        "Прийняття закону «Про виселення осіб, які ухилялись від трудової діяльності»",
        "1948"
    ],
    [
        "Сесія Всесоюзної академії сільськогосподарських наук (критика генетики, лисенківщина)",
        "1948"
    ],
    [
        "Запуск газопроводу Дашава–Київ",
        "1948"
    ],
    [
        "Знищення військами НКВС командира УПА Р. Шухевича",
        "березень 1950"
    ],
    [
        "Встановлення західного кордону УРСР",
        "1951"
    ],
    [
        "Повстання політичних в’язнів у сталінських таборах. Ліквідація ГУТАбу",
        "1953–1954"
    ],
    [
        "Обрання на посаду першого секретаря ЦК КПУ О. Кириченка ",
        "червень 1953"
    ],
    [
        "Уведення в експлуатацію першого в СРСР суцільнозварного мосту через Дніпро (за проєктом Є. Патона)",
        "листопад 1953"
    ],
    [
        "Початок освоєння цілинних і перелогових земель Казахстану, Алтаю та Сибіру",
        "лютий 1954"
    ],
    [
        "Входження Кримської області до складу УРСР",
        "лютий 1954"
    ],
    [
        "ХХ з’їзд КРПС, засудження культу особи",
        "лютий 1956"
    ],
    [
        "Реформа управління економікою – створення раднаргоспів",
        "1957"
    ],
    [
        "Запуск першого штучного супутника Землі",
        "1957"
    ],
    [
        "Закон «Про зміцнення зв’язку школи з життям і про подальший розвиток системи народної освіти в СРСР»",
        "грудень 1958"
    ],
    [
        "Утворення Української робітничо-селянської спілки ",
        "1959"
    ],
    [
        "Утворення Клубу творчої молоді «Сучасник» м. Київ",
        "1959"
    ],
    [
        "Суд у Львові над членами дисидентської організації – Української робітничо-селянської спілки (Л. Лук’яненко, Г. Кандиба та ін.)",
        "1961"
    ],
    [
        "Політ першого космонавта в космос (Ю. Гагарін)",
        "1961"
    ],
    [
        "ХХІІ з’їзд КПРС (ухвалення нової програми КПРС)",
        "жовтень 1961"
    ],
    [
        "Грошова реформа",
        "1961"
    ],
    [
        "Заснування Шевченківської премії з літератури та культури",
        "1962"
    ],
    [
        "Усунення з посади першого секретаря ЦК КПУ М. Підгорного; призначення на цю посаду П. Шелеста",
        "липень 1963"
    ],
    [
        "Усунення з посади першого секретаря ЦК КПРС М. Хрущова; обрання Л. Брежнєва",
        "жовтень 1964"
    ],
    [
        "Підготовка І. Дзюбою праці «Інтернаціоналізм чи русифікація?»",
        "вересень – грудень 1965"
    ],
    [
        "Перша хвиля масових затримань діячів антирежимного руху",
        "1965"
    ],
    [
        "VIIІ п’ятирічка («Золота п’ятирічка»)",
        "1966–1970"
    ],
    [
        "Підготовка В. Чорноволом збірки матеріалів «Лихо з розуму» про арешти в Україні ",
        "квітень 1967 "
    ],
    [
        "Публікація роману О. Гончара «Собор»",
        "січень 1968"
    ],
    [
        "Протест 139 діячів культури України проти арештів і утисків української культури",
        "березень 1968"
    ],
    [
        "Оприлюднення «Листа творчої молоді Дніпропетровська» (І. Сокульський)",
        "квітень 1968"
    ],
    [
        "Видання «самвидавного» журналу «Український вісник»",
        "1970–1972"
    ],
    [
        "Друга хвиля масових затримань діячів антирежимного руху ",
        "1972"
    ],
    [
        "Усунення з посади першого секретаря ЦК КПУ П. Шелеста; обрання на цю посаду В. Щербицького",
        "травень 1972"
    ],
    [
        "Перехід до загальної середньої освіти",
        "вересень 1972"
    ],
    [
        "Утворення Української громадської групи сприяння виконанню Гельсінських угод (УГГ)",
        "1976"
    ],
    [
        "Ухвалення нової Конституції СРСР",
        "жовтень 1977"
    ],
    [
        "Ухвалення нової Конституції УРСР",
        "квітень 1978"
    ],
    [
        "Прийняття Продовольчої програми СРСР",
        "травень 1982"
    ],
    [
        "Обрання М. Горбачова генеральним секретарем ЦК КПРС",
        "березень 1985"
    ],
    [
        "Початок «перебудови»",
        "квітень 1985"
    ],
    [
        "Постанова ЦК КПРС про подолання пияцтва та алкоголізму",
        "травень 1985"
    ],
    [
        "Смерть В. Стуса в таборі Мордовії ",
        "4 вересня 1985"
    ],
    [
        "Постанова ЦК КПРС про прискорення вирішення житлової проблеми в СРСР",
        "квітень 1986"
    ],
    [
        "Катастрофа на Чорнобильській атомній електростанції (АЕС)",
        "26 квітня 1986"
    ],
    [
        "Постанова ЦК КПРС про боротьбу з нетрудовими доходами",
        "травень 1986"
    ],
    [
        "Закон «Про індивідуальну трудову діяльність»",
        "листопад 1986"
    ],
    [
        "Перетворення Української групи сприяння виконанню Гельсінських угод на Українську Гельсінську спілку",
        "початок 1988"
    ],
    [
        "Установча конференція Товариства української мови ім. Т. Шевченка",
        "лютий 1989"
    ],
    [
        "Установча конференція товариства «Меморіал»",
        "травень 1989"
    ],
    [
        "Страйк шахтарів України",
        "липень 1989"
    ],
    [
        "Створення Народного руху України за перебудову",
        "вересень 1989"
    ],
    [
        "Усунення з посади першого секретаря ЦК КПУ В. Щербицького; обрання на цю посаду В. Івашка",
        "вересень 1989"
    ],
    [
        "Закон УРСР «Про мови в Українській РСР»",
        "жовтень 1989"
    ],
    [
        "Відродження громад Української Греко-Католицької Церкви. Створення Української православної церкви Московського патріархату (УПЦ МП). Перший собор Української автокефальної православної церкви (УАПЦ)",
        "1990"
    ],
    [
        "Проведення перших альтернативних виборів до Верховної Ради УРСР",
        "березень 1990"
    ],
    [
        "Початок роботи Верховної Ради як постійно діючого парламенту України",
        "травень 1990"
    ],
    [
        "Перехід Демократичного блоку у Верховній Раді УРСР до конструктивної опозиції, утворення Народної Ради",
        "червень 1990"
    ],
    [
        "Ухвалення Верховною Радою Декларації про державний суверенітет України",
        "16 липня 1990"
    ],
    [
        "Відставка В. Івашка; обрання головою Верховної Ради УРСР Л. Кравчука",
        "липень 1990"
    ],
    [
        "Закон УРСР про економічну самостійність республіки",
        "серпень 1990"
    ],
    [
        "«Революція на граніті»",
        "жовтень 1990"
    ],
    [
        "Реєстрація Української республіканської партії (опозиційна до КПРС)",
        "листопад 1990 "
    ],
    [
        "Запровадження продажу товарів за картками споживача з купонами",
        "1990"
    ],
    [
        "Ухвалення Верховною Радою постанови про відновлення автономії Криму",
        "лютий 1991"
    ],
    [
        "Створення Меджлісу кримськотатарського народу",
        "червень 1991"
    ],
    [
        "Спроба антиконституційного перевороту в СРСР (ДКНС)",
        "19–21 серпня 1991"
    ],
    [
        "Ухвалення Верховною Радою Акта проголошення незалежності України",
        "24 серпня 1991"
    ],
    [
        "Прийняття Указу Президії Верховної Ради України «Про заборону діяльності Компартії України»",
        "30 серпня 1991"
    ],
    [
        "Проведення Всеукраїнського референдуму та виборів Президента України",
        "1 грудня 1991"
    ],
    [
        "Започаткування Збройних Сил України ",
        "6 грудня 1991"
    ],
    [
        "Вступ України до Наради з безпеки і співробітництва в Європі (з 1995 р. – ОБСЄ)",
        "1992"
    ],
    [
        "Обрання Леоніда Кучми Президентом України",
        "липень 1994"
    ],
    [
        "Обрання України членом Ради Європи",
        "1995"
    ],
    [
        "Ухвалення Конституції України",
        "28 червня 1996"
    ],
    [
        "Запровадження грошової національної одиниці – гривні",
        "вересень 1996"
    ],
    [
        "«Помаранчева революція». Обрання Президентом України Віктора Ющенка",
        "жовтень – грудень 2004"
    ],
    [
        "Вступ України до Світової організації торгівлі (СОТ)",
        "2008"
    ],
    [
        "Обрання Президентом України В. Януковича",
        "січень 2010"
    ],
    [
        "«Революція Гідності». Повалення авторитарного режиму",
        "листопад 2013 – лютий 2014"
    ],
    [
        "Окупація Криму. Включення Криму з ініціативи В. Путіна до складу Російської Федерації",
        "18 березня 2014"
    ],
    [
        "Початок антитерористичної операції (АТО) на сході України",
        "14 квітня 2014"
    ],
    [
        "Обрання Президентом України П. Порошенка",
        "червень 2014"
    ],
    [
        "Підписання Україною Угоди про асоціацію з Європейським Союзом (ЄС)",
        "2014"
    ],
    [
        "Мінські домовленості",
        "вересень 2014; лютий 2015"
    ],
    [
        "Вручення Патріархом Варфоломієм томосу про автокефалію Православної Церкви України митрополиту Київському і всієї України Епіфанію",
        "січень 2019"
    ]
]
