const dates = [
    [
        "Битва на р.Сині Води",
        "1362 р."
    ],
    [
        "Укладення Кревської унії",
        "1385 р."
    ],
    [
        "Утворення Кримського ханства",
        "40-і роки ХV століття"
    ],
    [
        "Визнання Кримським ханством васальної залежностівід Османської імперії",
        "1478 р."
    ],
    [
        "Перша згадка про українських козаків у писемнихджерелах",
        "1489 р."
    ],
    [
        "Битва під Оршею",
        "1514 р."
    ],
    [
        "Створення Пересопницького Євангелія",
        "1556 - 1561 р."
    ],
    [
        "Заснування князем Д. Вишневецьким на о. МалаХортиця першої Січі",
        "1556 р."
    ],
    [
        "Люблінська унія. Утворення Речі Посполитої",
        "1569 р."
    ],
    [
        "Берестейська церковна унія. Утворення греко-католицької церкви",
        "1596 р."
    ],
    [
        "Похід козаків під проводом гетьмана П.Конашевича-Сагайдачного на Москву",
        "1618 р."
    ],
    [
        "Хотинська битва",
        "1621 р."
    ],
    [
        "Куруківська угода",
        "1625 р."
    ],
    [
        "«Пункти для заспокоєння руського народу»,утворення Києво- Могилянської колегії",
        "1632 р."
    ],
    [
        "Повстання під проводом Павла Павлюка, Якова Острянина, Дмитра Гуні",
        "1637 - 1638 рр."
    ],
    [
        "Жовтоводська, Корсунська та Пилявецька битви",
        "1648 р."
    ],
    [
        "Зборівська битва. Укладення Зборівського договору",
        "1649 р."
    ],
    [
        "Берестецька битва. Укладення Білоцерківського договору",
        "1651 р."
    ],
    [
        "Батозька битва",
        "1652 р."
    ],
    [
        "Жванецька облога",
        "1653 р."
    ],
    [
        "Переяславська рада, українсько-московський договір («Березневі статті»)",
        "1654 р."
    ],
    [
        "Московсько-польське Віленське перемир’я",
        "1656 р."
    ],
    [
        "Гадяцький договір",
        "1658 р."
    ],
    [
        "Конотопська битва",
        "1659 р."
    ],
    [
        "Андрусівське перемир’я",
        "1667 р."
    ],
    [
        "Корсунська угода, визнання Правобережною Гетьманщиною протекторату Османської імперії",
        "1669 р."
    ],
    [
        "Бахчисарайський мирний договір",
        "1681 р."
    ],
    [
        "«Вічний мир» між Московським царством і Річчю Посполитою",
        "1686 р."
    ],
    [
        "Українсько-шведський союз, зруйнування Батурина",
        "1708 р."
    ],
    [
        "Зруйнування російськими військами Чортомлицької Січі, Полтавська битва",
        "1709 рр."
    ],
    [
        "Конституція Пилипа Орлика",
        "1710 р."
    ],
    [
        "Ліквідація козацтва на Правобережній Україні",
        "1713 р."
    ],
    [
        "Заснування Нової (Підпільненської) Січі",
        "1734 р."
    ],
    [
        "Остаточна ліквідація гетьманства",
        "1764 р."
    ],
    [
        "Коліївщина",
        "1768 р."
    ],
    [
        "Остаточна ліквідація Запорозької Січі",
        "1775 р."
    ],
    [
        "Ліквідація особистої залежності селян в Австрійській імперії",
        "1780-1782 рр."
    ],
    [
        "Закріпачення селян Лівобережної та Слобідської України",
        "1783 р."
    ],
    [
        "Вихід друком «Енеїди» Івана Котляревського",
        "1798 р."
    ],
    [
        "Ліквідація Задунайської Січі, грудень 1825 - січень 1826 рр. - повстання Чернігівського полку",
        "1828 р."
    ],
    [
        "Польське визвольне повстання",
        "1830-1831 рр."
    ],
    [
        "Перше видання «Кобзаря» Т.Шевченка",
        "1840 р."
    ],
    [
        "Діяльність Кирило-Мефодіївського братства",
        "1846 -1847 рр."
    ],
    [
        "Створення освітнього товариства галицьких греко-католицьких священиків",
        "1816 рр."
    ],
    [
        "Діяльність «Руської трійці»",
        "1833 - 1837 рр."
    ],
    [
        "Скасування панщини в Галичині, видання першої україномовної газети «Зоря Галицька»",
        "1848 р."
    ],
    [
        "Відкриття університету в Харкові",
        "1805 р."
    ],
    [
        "Відкриття університету в Києві",
        "1834 р."
    ],
    [
        "Ліквідація царською владою греко-католицької церкви на Правобережжі",
        "1839 р."
    ],
    [
        "Царський маніфест про скасування кріпосного права в Російській імперії",
        "19 лютого 1861 р."
    ],
    [
        "Валуєвський циркуляр",
        "1863 р."
    ],
    [
        "Польське національно-визвольне повстання",
        "1863-1864 рр."
    ],
    [
        "Емський указ",
        "1876 р."
    ],
    [
        "Створення у Львові товариства «Просвіта»",
        "1868 р."
    ],
    [
        "Створення у Львові Літературного товариства ім. Т. Шевченка (від 1892 р. - Наукового товариства ім. Т. Шевченка)",
        "1873 р."
    ],
    [
        "Створення Русько-української радикальної партії",
        "1890 р."
    ],
    [
        "Створення Української Національно-демократичної партії та Української соціал-демократичної партії",
        "1899 р."
    ],
    [
        "Відкриття Новоросійського університету",
        "1865 р."
    ],
    [
        "Відкриття Чернівецького університету",
        "1875 р."
    ],
    [
        "Утворення Революційної української партії (РУП), першої політичної партії Наддніпрянської України",
        "1900 р."
    ],
    [
        "Створення Товариства українських поступовців (ТУП)",
        "1908 р."
    ],
    [
        "«справа Бейліса»",
        "1911-1913 рр."
    ],
    [
        "Обрання А.Шептицького митрополитом греко-католицької церкви",
        "1900 р."
    ],
    [
        "Впровадження в Австро-Угорській імперії загального виборчого права для чоловіків.серпень 1914 р. - утворення Головної української ради, формування легіону Українських січових стрільців, створення Союзу визволення України",
        "1907 р."
    ],
    [
        "Галицька битва",
        "1914 р."
    ],
    [
        "Утворення Загальної української ради",
        "1915 р."
    ],
    [
        "Брусиловський прорив",
        "1916 р."
    ],
    [
        "Утворення Української Центральної Ради",
        "Березень 1917 р."
    ],
    [
        "Всеукраїнський Національний конгрес",
        "Квітень 1917 р."
    ],
    [
        "Перший Універсал Центральної Ради",
        "Червень 1917 р."
    ],
    [
        "Другий Універсал Центральної Ради",
        "Липень 1917 р."
    ],
    [
        "Третій Універсал Центральної Ради, проголошення УНР",
        "Листопад 1917 р."
    ],
    [
        "Четвертий Універсал Центральної Ради, проголошення незалежності УНР",
        "22 (9) січня 1918 р."
    ],
    [
        "Бій під Крутами.січень (лютий) 1918 р. - Брестський мир між УНР та державами Четверного союзу",
        "Січень 1918 р."
    ],
    [
        "Державний переворот і прихід до влади П.Скоропадського",
        "29 квітня 1918 р."
    ],
    [
        "«Листопадовий зрив» у Львові",
        "1 листопада 1918 р."
    ],
    [
        "Проголошення Західноукраїнської Народної Республіки",
        "13 листопада 1918 р."
    ],
    [
        "Заснування Української академії наук",
        "Листопад 1918 р."
    ],
    [
        "Утворення Директорії",
        "14 листопада 1918 р."
    ],
    [
        "Проголошення Акта злуки УНР та ЗУНР",
        "22 січня 1919 р."
    ],
    [
        "Перший «Зимовий похід» військ УНР",
        "Грудень 1919 - травень 1920"
    ],
    [
        "Варшавська Угода",
        "Квітень 1920 р."
    ],
    [
        "Ризький мир",
        "Березень 1921 р."
    ],
    [
        "Другий «Зимовий похід» армії УНР",
        "Листопад 1921 р."
    ],
    [
        "Голод в Україні",
        "1921 - 1923 рр."
    ],
    [
        "Утворення Української автокефальної православної церкви (УАПЦ)",
        "1921 р."
    ],
    [
        "Входження УСРР до складу СРСР",
        "1922 р."
    ],
    [
        "Початок політики «українізації»",
        "1923 р."
    ],
    [
        "Проголошення курсу на індустріалізацію",
        "1925 р."
    ],
    [
        "Перша п’ятирічка",
        "1928/1929-1932 рр."
    ],
    [
        "Судовий процес у «Шахтинській справі»",
        "1928 р."
    ],
    [
        "Початок насильницької колективізації",
        "1929 р."
    ],
    [
        "Судовий процес у справі «Спілки визволення України»",
        "1930 р."
    ],
    [
        "Голодомор в Україні",
        "1932 - 1933 рр."
    ],
    [
        "Перенесення столиці УСРР з Харкова до Києва",
        "1934 р."
    ],
    [
        "Ухвалення Конституції УРСР",
        "1937 р."
    ],
    [
        "«Великий терор»",
        "1937-1938 рр."
    ],
    [
        "Підписання Бессарабського протоколу, визнання країнами Антанти входження Бессарабії до складу Румунії",
        "1920 р."
    ],
    [
        "Визнання країнами Антанти входження Східної Галичини до складу Польщі, саморозпуск уряду ЗУНР",
        "1923 р."
    ],
    [
        "Утворення Українського національно- демократичного об’єднання (УНДО)",
        "1925 р."
    ],
    [
        "Утворення ОУН",
        "1929 р."
    ],
    [
        "Проведення польською владою акції «пацифікації»",
        "1930 р."
    ],
    [
        "Надання автономії Підкарпатській Русі у складі Чехо- Словаччини",
        "1938 р."
    ],
    [
        "Проголошення незалежності Карпатської України",
        "15 березня 1939 р."
    ],
    [
        "Радянсько-німецький пакт про ненапад («пакт Молотова-Ріббентропа»)",
        "23 серпня 1939 р."
    ],
    [
        "Початок Другої світової війни",
        "1 вересня 1939 р."
    ],
    [
        "Вторгнення Червоної армії на територію Західної України",
        "17 вересня 1939 р."
    ],
    [
        "Вторгнення Червоної армії на територію Бессарабії та Північної Буковини",
        "червень 1940 р."
    ],
    [
        "Напад Німеччини на СРСР",
        "22 червня 1941 р."
    ],
    [
        "Проголошення Акта відновлення Української Держави",
        "30 червня 1941 р."
    ],
    [
        "Створення Української повстанської армії (УПА)",
        "14 жовтня 1942 р."
    ],
    [
        "Початок вигнання нацистських загарбників з України",
        "грудень 1942 р."
    ],
    [
        "Визволення Києва від нацистських окупантів",
        "6 листопада 1943 р."
    ],
    [
        "Корсунь-Шевченківська наступальна операція",
        "січень - лютий 1944 р."
    ],
    [
        "Завершення вигнання нацистських окупантів зі всієї території України",
        "28 жовтня 1944 р."
    ],
    [
        "День Перемоги над нацистською Німеччиною",
        "9 травня 1945 р."
    ],
    [
        "Завершення Другої світової війни",
        "2 вересня 1945 р."
    ],
    [
        "Входження Закарпаття до складу УРСР",
        "1945 р."
    ],
    [
        "Україна стає співзасновницею ООН",
        "квітень 1945 р."
    ],
    [
        "«саморозпуск» Української греко- католицької церкви (УГКЦ)",
        "березень 1946 р."
    ],
    [
        "Голод в Україні",
        "1946-1947 рр."
    ],
    [
        "Проведення польською владою операції «Вісла».1953-1954 рр. – повстання політичних в’язнів в сталінських концтаборах. Ліквідація ГУЛАГу",
        "квітень- липень 1947 р."
    ],
    [
        "Входження Кримської області до складу УРСР",
        "лютий 1954 р."
    ],
    [
        "ХХ з’їзд КПРС, засудження культу особи",
        "1956 р."
    ],
    [
        "Запуск першого штучного супутника Землі, початок «космічної ери»",
        "1957 р."
    ],
    [
        "Утворення Української робітничо-селянської спілки",
        "1959 р."
    ],
    [
        "Перший політ людини в Космос (Юрій Гагарін)",
        "1961 р."
    ],
    [
        "Реформи в сільському господарстві та промисловості(«косигінська реформа»), перша хвиля арештів дисидентів",
        "1965 р."
    ],
    [
        "Зміна політичного керівництва УРСР. В. Щербицький, масові арешти дисидентів",
        "1972 р."
    ],
    [
        "Утворення Української Гельсінської групи",
        "1976 р."
    ],
    [
        "Початок «перебудови»",
        "квітень 1985 р."
    ],
    [
        "Вибух на Чорнобильської АЕС",
        "26 квітня 1986 р."
    ],
    [
        "Виникнення Народний рух України заперебудову",
        "вересень 1989 р."
    ],
    [
        "Перші альтернативні вибори до ВерховноїРади УРСР",
        "березень 1990 р."
    ],
    [
        "Прийняття Верховною Радою Деклараціїпро державний суверенітет України",
        "16 липня 1990 р."
    ],
    [
        "«Революція на граніті»",
        "Жовтень 1990 р."
    ],
    [
        "Прийняття Верховною Радою УРСР Актапроголошення незалежності України",
        "24 серпня 1991 р."
    ],
    [
        "Всеукраїнський референдум і вибориПрезидента України. Обрання Президентом України Л.Кравчука",
        "1 грудня 1991 р."
    ],
    [
        "Заснування Збройних сил України",
        "6 грудня 1991 р."
    ],
    [
        "Обрання Л. Кучми Президентом України",
        "липень 1994 р."
    ],
    [
        "Обрання України членом Ради Європи (РЄ)",
        "1995 р."
    ],
    [
        "Ухвалення Конституції України",
        "28 червня 1996 р."
    ],
    [
        "Запровадження національної грошовоїодиниці – гривні",
        "вересень 1996 р."
    ],
    [
        "«Помаранчева революція»,обрання Президентом України В. Ющенка",
        "жовтень- грудень 2004 р."
    ],
    [
        "Вступ України до Світової організації торгівлі (СОТ)",
        "2008 р."
    ],
    [
        "Обрання В.Януковича Президентом України",
        "січень 2010 р."
    ],
    [
        "«Революція гідності», повалення режиму В.Януковича",
        "листопад 2013 - лютий 2014 рр."
    ],
    [
        "Обрання П.Порошенка ПрезидентомУкраїни",
        "червень 2014 р."
    ],
    [
        "Підписання Україною Угоди про асоціацію зЄвропейським Союзом (ЄС)",
        "2014 р."
    ],
    [
        "Мінські угоди",
        "вересень 2014 р., лютий 2015 р."
    ]
]
