const dates = [
    [
        "Перша згадка про козаків у писемних джерелах",
        "1489"
    ],
    [
        "Битва біля м. Орша",
        "1514"
    ],
    [
        "Заснування князем Дмитром Вишневецьким на о. Мала Хортиця першої відомої Січі",
        "1556"
    ],
    [
        "Створення Пересопницького Євангелія ",
        "1556–1561"
    ],
    [
        "Люблінська унія. Утворення Речі Посполитої (виборний король, спільний сейм, єдина грошова система, урівнено в правах польську та українську шляхту;  Литва зберігала за собою право та суд, адміністрацію, військо, «руську мову»)",
        "1569"
    ],
    [
        "Утворення першої братської (слов’яно-греко-латинської) школи у м. Львів",
        "1586"
    ],
    [
        "Берестейська церковна унія; утворення Української Греко-Католицької Церкви (УГКЦ)",
        "1596"
    ],
    [
        "Похід козаків під проводом П. Конашевича-Сагайдачного на Москву; підписання Деулінських угод; Річ Посполита отримала Чернігово-Сіверщину та Смоленщину",
        "1618"
    ],
    [
        "Відновлення вищої православної церковної ієрархії; висвячення Феофаном на посаду митрополита Йова Борецького (з ініціативи П. Конашевича-Сагайдачного)",
        "1620"
    ],
    [
        "Хотинська війна (участь військ гетьмана П. Конашевича-Сагайдачного проти Османської імперії разом із військами С. Жолкевського; поразка Османа у війні)",
        "1621"
    ],
    [
        "Куруківська угода (протистояння С. Конєцпольського з військами М. Жмайла поблизу м. Бар; створення 6 полків реєстровців)",
        "1625"
    ],
    [
        "«Пункти для заспокоєння руського народу»",
        "1632"
    ],
    [
        "Утворення Києво-Могилянської колегії",
        "1632"
    ],
    [
        "Повстання під проводом Павла Павлюка, Якова Острянина, Дмитра Гуні",
        "1637–1638"
    ],
    [
        "Битва під Жовтими Водами",
        "травень 1648"
    ],
    [
        "Битва під Корсунем (розгром 20-тисячних військ М. Потоцького)",
        "травень 1648"
    ],
    [
        "Битва під Пилявцями; оголошення «посполитого рушення» (шляхетського ополчення)",
        "вересень 1648"
    ],
    [
        "Зборівська битва, Зборівський договір (під владою гетьмана – Київське, Брацлавське, Чернігівське воєводства,; кількість реєстровців – 40 тисяч)",
        "1649"
    ],
    [
        "Берестецька битва, Білоцерківський  договір (під владою гетьмана – Київщина, кількість реєстровців – 20 тисяч; поляки повертаються на свої землі)",
        "1651"
    ],
    [
        "Батозька битва (помста за Берестечко)",
        "1652"
    ],
    [
        "Битва під Жванцем, Камʼянецький договір (домовленість поляків і татар про припинення воєнних дій; Хмельницький у переговорах участі не брав)",
        "1653"
    ],
    [
        "Переяславська рада, українсько-московський договір («Березневі статті») (присяга гетьмана і козаків на вірність московському царю Олексію; Конфедерація)",
        "1654"
    ],
    [
        "Московсько-польське Віленське перемир’я (обіцянка Речі Посполитої надати корону російському царю Олексію)",
        "1656"
    ],
    [
        "Гадяцький договір (сторони договору: Польща, Литва, Велике князівство Руське)",
        "1658"
    ],
    [
        "Конотопська битва",
        "1659"
    ],
    [
        "Андрусівський перемир’я між Московією та Польщею (без українців); юридичний поділ України",
        "1667"
    ],
    [
        "Корсунська угода, визнання Правобережною Гетьманщиною протекторату Османської імперії",
        "1669"
    ],
    [
        "Бахчисарайський мирний договір (сторони договору: Туреччина, Московія)",
        "1681"
    ],
    [
        "«Вічний мир» між Московським царством і Річчю Посполитою  (Брацлавщина та південна Київщина мали бути нейтральними).\n\nПідпорядкування Київської митрополії Московському патріархатові ",
        "1686"
    ],
    [
        "Україно-шведський союз, зруйнування Батурина",
        "1708"
    ],
    [
        "Зруйнування московитськими військами Чортомлицької січі, Полтавська битва",
        "1709"
    ],
    [
        "«Конституція…» Пилипа Орлика («Пакти й конституції законів і вольностей Війська Запорозького»: вступ і 16 статей). Обрання П. Орлика гетьманом",
        "1710"
    ],
    [
        "Ліквідація козацтва на Правобережній Україні",
        "1713"
    ],
    [
        "Заснування Нової (Підпільненської) Січі (кошовий отаман І. Білицький, край поділено на 8 паланок (округів)",
        "1734"
    ],
    [
        "Остаточна ліквідація посади гетьмана",
        "1764"
    ],
    [
        "Коліївщина (керівники: М. Залізняк, І. Гонта; повстання охопило Київщину та Брацлавщину, зокрема гайдамаки взяли Умань; повстання придушене російською владою; страта гайдамаків відбувалась у м. Кодня)",
        "1768"
    ],
    [
        "І поділ Речі Посполитої (Галичина відходить до Австрійської імперії)",
        "1772"
    ],
    [
        "Остаточна ліквідація Запорозької Січі (наказ Катерини ІІ генералові П. Текелі; російська армія напала і зруйнувала Січ, останній кошовий отаман П. Калнишевський ув’язнений у Соловецький монастир. Задунайська Січ, Банатська Січ)",
        "1775"
    ],
    [
        "Ліквідація особистої залежності селян в Австрійській імперії",
        "1780–1782"
    ],
    [
        "Закріпачення селян Лівобережної та Слобідської України.\n\nПідкорення Російською імперією Кримського ханства\n\n(ліквідований полковий устрій, запроваджено повіти)",
        "1783"
    ],
    [
        "ІІ поділ Речі Посполитої (Правобережжя переходить під контроль Російської імперії)",
        "1793"
    ],
    [
        "ІІІ поділ Речі Посполитої (Річ посполита припинила своє існування, до Росії відходять землі західної Волині)",
        "1795"
    ],
    [
        "Видання «Енеїди» І. Котляревського ",
        "1798"
    ],
    [
        "Відкриття Харківського університету (з ініціативи В. Каразіна)",
        "1805"
    ],
    [
        "Створення освітнього товариства греко-католицьких священників (у Перемишлі під патронатом єпископа М. Левицького помічник І. Могильницький зібрав гурт священників і заснував перше просвітницьке товариство греко-католицьких священників)",
        "1816"
    ],
    [
        "Повстання Чернігівського полку",
        "грудень 1825 – січень 1826"
    ],
    [
        "Ліквідація Задунайської Січі",
        "1828"
    ],
    [
        "Польське визвольне повстання",
        "1830–1831"
    ],
    [
        "Діяльність  «Руської трійці» (М. Шашкевич, Я. Головацький, І. Вагилевич)",
        "1833–1837"
    ],
    [
        "Відкриття університету в Києві (Університет святого Володимира, ректор М. Максимович)",
        "1834"
    ],
    [
        "Видання «Русалки Дністрової» (у Будапешті стараннями Я. Головацького)",
        "1837"
    ],
    [
        "Ліквідація царською владою Греко-Католицької Церкви на Правобережжі",
        "1839"
    ],
    [
        "Перше видання «Кобзаря» Тараса Шевченка (Петербург)",
        "1840"
    ],
    [
        "Діяльність Кирило-Мефодіївського братства (засновники: М. Костомаров, М. Гулак, В. Білозерський; програмні документи: «Книга буття українського народу», «Статут братства св. Кирила та Мефодія»)",
        "1846–1847"
    ],
    [
        "Скасування панщини в Галичині",
        "1848"
    ],
    [
        "Створення Головної Руської Ради. Видання першої українськомовної газети «Зоря Галицька»",
        "1848"
    ],
    [
        "Діяльність Головної руської ради",
        "1848–1851"
    ],
    [
        "Царський маніфест про скасування кріпосного права в Російській імперії (категорія тимчасовозобов’язаних була скасована через 20 років; відрізки / прирізки на Правобережжі)",
        "19 лютого\n\n1861"
    ],
    [
        "Валуєвський циркуляр (заборона друкування українською мовою освітніх і релігійних видань)",
        "1863"
    ],
    [
        "Польське національно-визвольне повстання (повстання проти Росії, охопило й Правобережну Україну)",
        "1863–1864"
    ],
    [
        "Відкриття Новоросійського університету (Одеса)",
        "1865"
    ],
    [
        "Створення у м. Львові товариства «Просвіта»",
        "1868"
    ],
    [
        "Створення у м. Львові літературного товариства ім. Т. Шевченка (від 1892 р. – Наукове товариство ім. Тараса Шевченка)",
        "1873"
    ],
    [
        "Діяльність Південно-Західного відділу Російського географічного товариства",
        "1873–1876"
    ],
    [
        "Відкриття Чернівецького університету",
        "1875"
    ],
    [
        "Емський указ (заборона української мови імператором Олександром ІІ)",
        "1876"
    ],
    [
        "Створення Русько-української радикальної партії (РУРП)",
        "1890"
    ],
    [
        "Створення Української національно-демократичної партії та Української соціал-демократичної партії",
        "1899"
    ],
    [
        "Створення Революційної української партії (РУП)",
        "1900"
    ],
    [
        "Обрання Андрея Шептицького митрополитом Української Греко-Католицької Церкви",
        "1900"
    ],
    [
        "Створення перших в Наддніпрянській Україні товариств «Просвіта» (Катеринослав, Одеса)",
        "1905"
    ],
    [
        "Упровадження в Австро-Угорській імперії виборчого права для чоловіків",
        "1907"
    ],
    [
        "Створення Товариства українських поступовців (ТУП)",
        "1908"
    ],
    [
        "Створення Головної Української Ради. Формування легіону Українських січових стрільців (УСС). Створення Союзу визволення України (СВУ)",
        "серпень 1914 "
    ],
    [
        "Галицька битва",
        "серпень-вересень 1914"
    ],
    [
        "Утворення Загальної української ради (Відень)",
        "1915"
    ],
    [
        "«Брусиловський прорив»",
        "1916 "
    ],
    [
        "Утворення Української Центральної Ради (УЦР)",
        "березень 1917"
    ],
    [
        "Всеукраїнський Національний  Конгрес.",
        "квітень 1917"
    ],
    [
        "Перший Універсал УЦР (проголошення автономії). Утворення Генерального секретаріату на чолі з В. Винниченком",
        "червень 1917"
    ],
    [
        "Другий Універсал УЦР.",
        "липень 1917"
    ],
    [
        "Третій Універсал УЦР (проголошення Української Народної Республіки (УНР), соціально-економічні питання)",
        "листопад 1917"
    ],
    [
        "Четвертий Універсал УЦР (проголошення незалежності Української Народної Республіки)",
        "9(22) січня 1918"
    ],
    [
        "Бій під Крутами.",
        "січень 1918"
    ],
    [
        "Брест-Литовський мирний договір між УНР та державами Четверного союзу",
        "січень (лютий) 1918"
    ],
    [
        "Державний переворот і прихід до влади Павла Скоропадського.\n\nУкраїнська держава (виконавчий орган влади – Рада міністрів)",
        "29 квітня 1918"
    ],
    [
        "Листопадовий чин у Львові",
        "1 листопада 1918"
    ],
    [
        "Проголошення Західноукраїнської народної Республіки (ЗУНР).\n\nСтворення Державного секретаріату ЗУНР. Утворення Української Галицької армії (УГА)",
        "13 листопада 1918"
    ],
    [
        "Українсько-польська війна",
        "1918–1919"
    ],
    [
        "Утворення Директорії (голова – В. Винниченко)",
        "14 листопада 1918"
    ],
    [
        "Заснування Української академії наук (УАН) (президент УАН – В. Вернадський)",
        "листопад 1918"
    ],
    [
        "Проголошення Акта злуки УНР і ЗУНР",
        "22 січня 1919"
    ],
    [
        "Холодноярська республіка",
        "1919–1922"
    ],
    [
        "Перший Зимовий похід армії УНР (під керівництвом М. Омеляновича-Павленка)",
        "грудень 1919 – травень 1920"
    ],
    [
        "Варшавська угода між Польщею та УНР (підписали Ю. Пілсудський, С. Петлюра)",
        "квітень 1920"
    ],
    [
        "Підписання Бессарабського протоколу, визнання країнами Антанти входження Бессарабії до складу Румунії",
        "1920"
    ],
    [
        "Ризький мирний договір (сторони договору: Польща, РСФРР, УСРР, БСРР)",
        "березень 1921"
    ],
    [
        "Другий Зимовий похід армії УНР (під керівництвом Ю. Тютюнника)",
        "листопад 1921"
    ],
    [
        "Утворення Української автокефальної православної церкви (УАПЦ)",
        "1921"
    ],
    [
        "Масовий голод в Україні",
        "1921–1923"
    ],
    [
        "Проголошення коренізації (українізації)",
        "1923"
    ],
    [
        "Визнання країнами Антанти входження Східної Галичини до складу Польщі, саморозпуск уряду ЗУНР",
        "1923"
    ],
    [
        "Проголошення курсу на індустріалізацію",
        "1925"
    ],
    [
        "Утворення Українського національно-демократичного об’єднання (УНДО)",
        "1925"
    ],
    [
        "Судовий процес у «Шахтинській справі»",
        "1928"
    ],
    [
        "Початок насильницької колективізації.",
        "1929"
    ],
    [
        "Утворення Організації українських націоналістів (ОУН)",
        "1929"
    ],
    [
        "Судовий процес Спілки визволення України (СВУ)",
        "1930"
    ],
    [
        "Проведення польською владою акції «пацифікації» (Східна Галичина)",
        "1930"
    ],
    [
        "Голодомор в Україні.",
        "1932–1933"
    ],
    [
        "Перенесення столиці УСРР з Харкова до Києва",
        "1934"
    ],
    [
        "Ухвалення Конституції УРСР (нова (Сталінська) Конституція УРСР)",
        "1937"
    ],
    [
        "«Великий терор» («Розстріляне відродження»)",
        "1937–1938"
    ],
    [
        "Надання автономії Підкарпатській Русі у складі Чехо-Словаччини",
        "1938"
    ],
    [
        "Проголошення незалежності Карпатської України",
        "15 березня 1939"
    ],
    [
        "Радянсько-німецький договір про ненапад і таємний протокол до нього («пакт Молотова–Ріббентропа») ",
        "23 серпня 1939"
    ],
    [
        "Початок Другої світової війни; вторгнення нацистських військ на територію Польщі",
        "1 вересня 1939"
    ],
    [
        "Вторгнення Червоної армії на територію Західної України ",
        "17 вересня 1939"
    ],
    [
        "Вторгнення Червоної Армії на територію Бессарабії та Північної Буковини",
        "червень 1940"
    ],
    [
        "Напад Німеччини на СРСР",
        "22 червня 1941"
    ],
    [
        "Проголошення Акта відновлення Української Держави",
        "30 червня 1941"
    ],
    [
        "Створення Української Повстанської Армії (УПА) ",
        "14 жовтня 1942"
    ],
    [
        "Початок вигнання німецьких військ та їх союзників з України",
        "грудень 1942"
    ],
    [
        "Вигнання німецьких окупантів з м. Києва",
        "6 листопада 1943"
    ],
    [
        "Корсунь-Шевченківська наступальна операція",
        "січень-лютий 1944"
    ],
    [
        "Завершення вигнання німецьких військ та їх союзників з України",
        "28 жовтня 1944"
    ],
    [
        "Україна – співзасновниця Організації Об’єднаних Націй (ООН)",
        "квітень 1945"
    ],
    [
        "День перемоги над нацизмом у Другій світовій війні",
        "9 травня 1945"
    ],
    [
        "Завершення  Другої світової війни",
        "2 вересня 1945"
    ],
    [
        "Входження Закарпаття до складу УРСР",
        "1945"
    ],
    [
        "Ліквідація УГКЦ ",
        "березень 1946"
    ],
    [
        "Масовий голод в Україні",
        "1946–1947"
    ],
    [
        "Проведення польською владою операції «Вісла»",
        "квітень – липень 1947"
    ],
    [
        "Операція «Захід»",
        "жовтень 1947"
    ],
    [
        "Встановлення західного кордону УРСР",
        "1951"
    ],
    [
        "Повстання політичних в’язнів у сталінських таборах. Ліквідація ГУТАбу",
        "1953–1954"
    ],
    [
        "Входження Кримської області до складу УРСР",
        "лютий 1954"
    ],
    [
        "ХХ з’їзд КРПС, засудження культу особи",
        "лютий 1956"
    ],
    [
        "Утворення Української робітничо-селянської спілки ",
        "1959"
    ],
    [
        "Утворення Клубу творчої молоді «Сучасник» м. Київ",
        "1959"
    ],
    [
        "Перша хвиля масових затримань діячів антирежимного руху",
        "1965"
    ],
    [
        "Видання «самвидавного» журналу «Український вісник»",
        "1970–1972"
    ],
    [
        "Друга хвиля масових затримань діячів антирежимного руху ",
        "1972"
    ],
    [
        "Утворення Української громадської групи сприяння виконанню Гельсінських угод (УГГ)",
        "1976"
    ],
    [
        "Початок «перебудови»",
        "квітень 1985"
    ],
    [
        "Катастрофа на Чорнобильській атомній електростанції (АЕС)",
        "26 квітня 1986"
    ],
    [
        "Створення Народного руху України за перебудову",
        "вересень 1989"
    ],
    [
        "Проведення перших альтернативних виборів до Верховної Ради УРСР",
        "березень 1990"
    ],
    [
        "Ухвалення Верховною Радою Декларації про державний суверенітет України",
        "16 липня 1990"
    ],
    [
        "«Революція на граніті»",
        "жовтень 1990"
    ],
    [
        "Ухвалення Верховною Радою Акта проголошення незалежності України",
        "24 серпня 1991"
    ],
    [
        "Проведення Всеукраїнського референдуму та виборів Президента України",
        "1 грудня 1991"
    ],
    [
        "Започаткування Збройних Сил України ",
        "6 грудня 1991"
    ],
    [
        "Обрання Леоніда Кучми Президентом України",
        "липень 1994"
    ],
    [
        "Обрання України членом Ради Європи",
        "1995"
    ],
    [
        "Ухвалення Конституції України",
        "28 червня 1996"
    ],
    [
        "Запровадження грошової національної одиниці – гривні",
        "вересень 1996"
    ],
    [
        "«Помаранчева революція». Обрання Президентом України Віктора Ющенка",
        "жовтень – грудень 2004"
    ],
    [
        "Вступ України до Світової організації торгівлі (СОТ)",
        "2008"
    ],
    [
        "Обрання Президентом України В. Януковича",
        "січень 2010"
    ],
    [
        "«Революція Гідності». Повалення авторитарного режиму",
        "листопад 2013 – лютий 2014"
    ],
    [
        "Обрання Президентом України П. Порошенка",
        "червень 2014"
    ],
    [
        "Підписання Україною Угоди про асоціацію з Європейським Союзом (ЄС)",
        "2014"
    ],
    [
        "Мінські домовленості",
        "вересень 2014; лютий 2015"
    ]
]
