const info = [
    ["Вітаю в електронному тренажері з історії Україні. Свайпніть вгору, щоб перейти далі.", "Це тренажерна карточка."],
    ["Це передня частина карточки. Тут будуть персони, події та культурні памʼятки.", "Це досі тренувальна карточка."],
    ["Натисніть на карточку, щоб відкрити зворотній бік.", "Це зворотня частина карточки. Тут іменя, роки та назви відповідно."],
    ["Знизу карточок є номер поточної карточки та загальна кількість в цій секції.", "Тут, ніби, нічого :)"],
    ["Щоб повернутись до попередньої карточки, свайпніть вниз.", "Таки, тут нічтого немає."],
    ["Вітаю і дякую за проходження інструкції з користання!", "А може щось таки є? ;)"],
];
